

AAA Working Group                                         Pat R. Calhoun
Internet-Draft                                      Black Storm Networks
Category: Standards Track                                      Glen Zorn
                                                     Cisco Systems, Inc.
                                                            David Spence
                                                Interlink Networks, Inc.
                                                            David Mitton
                                                          Circular Logic

                                                           February 2003

               Diameter Network Access Server Application
                 draft-ietf-aaa-diameter-nasreq-11.txt


Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt The list of Internet-Draft
   Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This document is a product of the Authentication, Authorization and
   Accounting (AAA) Working Group of the Internet Engineering Task Force
   (IETF).  Comments are welcome should be submitted to the mailing list
   aaa-wg@merit.edu.

   Copyright (C) The Internet Society 2003.  All Rights Reserved.










Calhoun et al.             Expires August 2003                  [Page 1]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


Abstract

   This document describes Diameter applications that are used for
   Authentication, Authorization and Accounting (AAA) in the Network
   Access Server (NAS) environment. This application, combined with the
   Diameter base protocol, Transport Profile, EAP and CMS Security
   specifications, satisfies typical network access services
   requirements.

   Initial deployments of the Diameter protocol are expected to include
   legacy systems. Therefore, this application was carefully designed to
   ease the burden of protocol conversion between RADIUS and Diameter.
   This is achieved by including the RADIUS attribute space, and
   eliminating the need to perform many attribute translations.





































Calhoun et al.             Expires August 2003                  [Page 2]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                           Table of Contents


1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . . .   6
1.1.  Requirements Language  . . . . . . . . . . . . . . . . . . . .   6
1.2.  Advertising Application Support  . . . . . . . . . . . . . . .   6
2.  NAS Calls, Ports, and Sessions . . . . . . . . . . . . . . . . .   6
2.1.  Diameter Session Establishment . . . . . . . . . . . . . . . .   7
2.2.  Diameter Session Re-Authentication or Re-Authorization . . . .   7
2.3.  Diameter Session Termination . . . . . . . . . . . . . . . . .   8
3.  NAS Messages . . . . . . . . . . . . . . . . . . . . . . . . . .   8
3.1.  AA-Request (AAR) Command . . . . . . . . . . . . . . . . . . .   8
3.2.  AA-Answer (AAA) Command  . . . . . . . . . . . . . . . . . . .  10
4.  NAS Session AVPs . . . . . . . . . . . . . . . . . . . . . . . .  12
4.1.  Call and Session Information . . . . . . . . . . . . . . . . .  12
4.2.  NAS-Port AVP . . . . . . . . . . . . . . . . . . . . . . . . .  13
4.3.  NAS-Port-Id AVP  . . . . . . . . . . . . . . . . . . . . . . .  13
4.4.  NAS-Port-Type AVP  . . . . . . . . . . . . . . . . . . . . . .  14
4.5.  Called-Station-Id AVP  . . . . . . . . . . . . . . . . . . . .  14
4.6.  Calling-Station-Id AVP . . . . . . . . . . . . . . . . . . . .  15
4.7.  Connect-Info AVP . . . . . . . . . . . . . . . . . . . . . . .  15
4.8.  Originating-Line-Info AVP  . . . . . . . . . . . . . . . . . .  15
4.9.  Reply-Message AVP  . . . . . . . . . . . . . . . . . . . . . .  17
4.10.  Termination-Action AVP  . . . . . . . . . . . . . . . . . . .  17
5.  NAS Authentication AVPs  . . . . . . . . . . . . . . . . . . . .  18
5.1.  User-Password AVP  . . . . . . . . . . . . . . . . . . . . . .  19
5.2.  Password-Retry AVP . . . . . . . . . . . . . . . . . . . . . .  19
5.3.  Prompt AVP . . . . . . . . . . . . . . . . . . . . . . . . . .  20
5.4.  CHAP-Auth AVP  . . . . . . . . . . . . . . . . . . . . . . . .  20
5.5.  CHAP-Algorithm AVP . . . . . . . . . . . . . . . . . . . . . .  20
5.6.  CHAP-Ident AVP . . . . . . . . . . . . . . . . . . . . . . . .  21
5.7.  CHAP-Response AVP  . . . . . . . . . . . . . . . . . . . . . .  21
5.8.  CHAP-Challenge AVP . . . . . . . . . . . . . . . . . . . . . .  21
5.9.  ARAP-Password AVP  . . . . . . . . . . . . . . . . . . . . . .  21
5.10.  ARAP-Challenge-Response AVP . . . . . . . . . . . . . . . . .  21
5.11.  ARAP-Security AVP . . . . . . . . . . . . . . . . . . . . . .  21
5.12.  ARAP-Security-Data AVP  . . . . . . . . . . . . . . . . . . .  22
6.  NAS Authorization AVPs . . . . . . . . . . . . . . . . . . . . .  22
6.1.  Service-Type AVP . . . . . . . . . . . . . . . . . . . . . . .  23
6.2.  Callback-Number AVP  . . . . . . . . . . . . . . . . . . . . .  24
6.3.  Callback-Id AVP  . . . . . . . . . . . . . . . . . . . . . . .  25
6.4.  Idle-Timeout AVP . . . . . . . . . . . . . . . . . . . . . . .  25
6.5.  Port-Limit AVP . . . . . . . . . . . . . . . . . . . . . . . .  25
6.6.  NAS-Filter-Rule AVP  . . . . . . . . . . . . . . . . . . . . .  25
6.7.  Filter-Id AVP  . . . . . . . . . . . . . . . . . . . . . . . .  25
6.8.  Configuration-Token AVP  . . . . . . . . . . . . . . . . . . .  26
6.9.  Framed Access Authorization AVPs . . . . . . . . . . . . . . .  26
6.9.1.  Framed-Protocol AVP  . . . . . . . . . . . . . . . . . . . .  26



Calhoun et al.             Expires August 2003                  [Page 3]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.9.2.  Framed-Routing AVP . . . . . . . . . . . . . . . . . . . . .  26
6.9.3.  Framed-MTU AVP . . . . . . . . . . . . . . . . . . . . . . .  27
6.9.4.  Framed-Compression AVP . . . . . . . . . . . . . . . . . . .  27
6.10.  IP Access . . . . . . . . . . . . . . . . . . . . . . . . . .  27
6.10.1.  Framed-IP-Address AVP . . . . . . . . . . . . . . . . . . .  28
6.10.2.  Framed-IP-Netmask AVP . . . . . . . . . . . . . . . . . . .  28
6.10.3.  Framed-Route AVP  . . . . . . . . . . . . . . . . . . . . .  28
6.10.4.  Framed-Pool AVP . . . . . . . . . . . . . . . . . . . . . .  29
6.10.5.  Framed-Interface-Id AVP . . . . . . . . . . . . . . . . . .  29
6.10.6.  Framed-IPv6-Prefix AVP  . . . . . . . . . . . . . . . . . .  29
6.10.7.  Framed-IPv6-Route AVP . . . . . . . . . . . . . . . . . . .  29
6.10.8.  Framed-IPv6-Pool AVP  . . . . . . . . . . . . . . . . . . .  30
6.11.  IPX Access  . . . . . . . . . . . . . . . . . . . . . . . . .  30
6.11.1.  Framed-IPX-Network AVP  . . . . . . . . . . . . . . . . . .  30
6.12.  Appletalk Access  . . . . . . . . . . . . . . . . . . . . . .  30
6.12.1.  Framed-AppleTalk-Link AVP . . . . . . . . . . . . . . . . .  31
6.12.2.  Framed-AppleTalk-Network AVP  . . . . . . . . . . . . . . .  31
6.12.3.  Framed-AppleTalk-Zone AVP . . . . . . . . . . . . . . . . .  31
6.13.  ARAP Access . . . . . . . . . . . . . . . . . . . . . . . . .  31
6.13.1.  ARAP-Features AVP . . . . . . . . . . . . . . . . . . . . .  32
6.13.2.  ARAP-Zone-Access AVP  . . . . . . . . . . . . . . . . . . .  32
6.14.  Non-Framed Access Authorization AVPs  . . . . . . . . . . . .  32
6.14.1.  Login-IP-Host AVP . . . . . . . . . . . . . . . . . . . . .  32
6.14.2.  Login-IPv6-Host AVP . . . . . . . . . . . . . . . . . . . .  32
6.14.3.  Login-Service AVP . . . . . . . . . . . . . . . . . . . . .  33
6.15.  TCP Services  . . . . . . . . . . . . . . . . . . . . . . . .  33
6.15.1.  Login-TCP-Port AVP  . . . . . . . . . . . . . . . . . . . .  33
6.15.2.  LAT Services  . . . . . . . . . . . . . . . . . . . . . . .  34
6.15.3.  Login-LAT-Service AVP . . . . . . . . . . . . . . . . . . .  34
6.15.4.  Login-LAT-Node AVP  . . . . . . . . . . . . . . . . . . . .  34
6.15.5.  Login-LAT-Group AVP . . . . . . . . . . . . . . . . . . . .  35
6.15.6.  Login-LAT-Port AVP  . . . . . . . . . . . . . . . . . . . .  35
7.  Tunneling Group AVPs . . . . . . . . . . . . . . . . . . . . . .  36
7.1.  Tunnel-Type AVP  . . . . . . . . . . . . . . . . . . . . . . .  37
7.2.  Tunnel-Medium-Type AVP . . . . . . . . . . . . . . . . . . . .  37
7.3.  Tunnel-Client-Endpoint AVP . . . . . . . . . . . . . . . . . .  38
7.4.  Tunnel-Server-Endpoint AVP . . . . . . . . . . . . . . . . . .  39
7.5.  Tunnel-Password AVP  . . . . . . . . . . . . . . . . . . . . .  39
7.6.  Tunnel-Private-Group-Id AVP  . . . . . . . . . . . . . . . . .  40
7.7.  Tunnel-Assignment-Id AVP . . . . . . . . . . . . . . . . . . .  40
7.8.  Tunnel-Preference AVP  . . . . . . . . . . . . . . . . . . . .  41
7.9.  Tunnel-Client-Auth-Id AVP  . . . . . . . . . . . . . . . . . .  42
7.10.  Tunnel-Server-Auth-Id AVP . . . . . . . . . . . . . . . . . .  42
8.  NAS Accounting . . . . . . . . . . . . . . . . . . . . . . . . .  42
8.1.  Accounting-Input-Octets AVP  . . . . . . . . . . . . . . . . .  43
8.2.  Accounting-Output-Octets AVP . . . . . . . . . . . . . . . . .  44
8.3.  Accounting-Input-Packets AVP . . . . . . . . . . . . . . . . .  44
8.4.  Accounting-Output-Packets AVP  . . . . . . . . . . . . . . . .  44



Calhoun et al.             Expires August 2003                  [Page 4]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


8.5.  Acct-Session-Time AVP  . . . . . . . . . . . . . . . . . . . .  44
8.6.  Acct-Authentic AVP . . . . . . . . . . . . . . . . . . . . . .  44
8.7.  Acct-Delay-Time  . . . . . . . . . . . . . . . . . . . . . . .  45
8.8.  Acct-Link-Count  . . . . . . . . . . . . . . . . . . . . . . .  45
8.9.  Acct-Tunnel-Connection AVP . . . . . . . . . . . . . . . . . .  46
8.10.  Acct-Tunnel-Packets-Lost AVP  . . . . . . . . . . . . . . . .  46
9.  RADIUS/Diameter Protocol Interactions  . . . . . . . . . . . . .  46
9.1.  RADIUS Request Forwarded as Diameter Request . . . . . . . . .  47
9.1.1.  Diameter Request Forwarded as RADIUS Request . . . . . . . .  50
9.2.  AVPs Used Only for Compatibility . . . . . . . . . . . . . . .  51
9.2.1.  NAS-Identifier AVP . . . . . . . . . . . . . . . . . . . . .  51
9.2.2.  NAS-IP-Address AVP . . . . . . . . . . . . . . . . . . . . .  52
9.2.3.  NAS-IPv6-Address AVP . . . . . . . . . . . . . . . . . . . .  52
9.2.4.  State AVP  . . . . . . . . . . . . . . . . . . . . . . . . .  53
9.2.5.  Termination-Cause AVP Code Values  . . . . . . . . . . . . .  54
9.3.  Prohibited RADIUS Attributes . . . . . . . . . . . . . . . . .  56
9.4.  Translatable Diameter AVPs . . . . . . . . . . . . . . . . . .  56
9.5.  RADIUS Vendor Specific Attributes  . . . . . . . . . . . . . .  56
9.5.1.  Forwarding a Diameter Vendor AVP as a RADIUS VSA . . . . . .  56
9.5.2.  Forwarding a RADIUS VSA to a Diameter Vendor AVP . . . . . .  57
10.  AVP Occurrence Tables . . . . . . . . . . . . . . . . . . . . .  57
10.1.  AA-Request/Answer AVP Table . . . . . . . . . . . . . . . . .  58
10.2.  Accounting AVP Tables . . . . . . . . . . . . . . . . . . . .  61
10.2.1.  Accounting Framed Access AVP Table  . . . . . . . . . . . .  61
10.2.2.  Accounting Non-Framed Access AVP Table  . . . . . . . . . .  62
11.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . .  64
11.1.  Command Codes . . . . . . . . . . . . . . . . . . . . . . . .  64
11.2.  AVP Codes . . . . . . . . . . . . . . . . . . . . . . . . . .  64
11.3.  Application Identifier  . . . . . . . . . . . . . . . . . . .  64
11.4.  CHAP-Algorithm AVP Values . . . . . . . . . . . . . . . . . .  64
12.  Security Considerations . . . . . . . . . . . . . . . . . . . .  65
13.  References  . . . . . . . . . . . . . . . . . . . . . . . . . .  65
13.1.  Normative References  . . . . . . . . . . . . . . . . . . . .  65
13.2.  Informative References  . . . . . . . . . . . . . . . . . . .  66
14.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . .  68
15.  Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . .  68
Intellectual Property Considerations . . . . . . . . . . . . . . . .  69
Full Copyright Statement . . . . . . . . . . . . . . . . . . . . . .  70













Calhoun et al.             Expires August 2003                  [Page 5]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


1.  Introduction

   This document describes Diameter applications that are used for AAA
   in the Network Access Server (NAS) environment. The Diameter NAS
   application, when combined with the Diameter base protocol [Base],
   Transport Profile [DiamTrans] EAP [DiamEAP], and CMS Security
   [DiamCMS] specifications, satisfies NAS-related requirements defined
   in RFC2989 [AAACriteria] and RFC3169 [NASCriteria].

   Initial deployments of the Diameter protocol are expected to include
   legacy systems. Therefore, this application was carefully designed to
   ease the burden of protocol conversion between RADIUS and Diameter.
   This is achieved by including the RADIUS attribute space, and
   eliminating the need to perform many attribute translations.

   This document first describes the operation of a Diamter NAS
   application.  Then it defines the Diameter message Command-Codes.
   The following sections enumerate the AVPs used in these messages
   grouped by common usage.  These are Session Identification,
   Authentication, Authorization, and Accounting.  The Authorization
   AVPs are further broken down by service type.  Interaction and
   backwards compatibility issues with RADIUS are discussed in later
   sections.


1.1.  Requirements Language

   In this document, the key words "MAY", "MUST", "MUST NOT",
   "OPTIONAL", "RECOMMENDED", "SHOULD", and "SHOULD NOT", are to be
   interpreted as described in [Keywords].


1.2.  Advertising Application Support

   Diameter nodes conforming to this specification MAY advertise support
   by including the value of one (1) in the Auth-Application-Id or the
   Acct-Application-Id AVP of the Capabilities-Exchange-Request and
   Capabilities-Exchange-Answer commands [Base].


2.  NAS Calls, Ports, and Sessions

   The arrival of a new call or service connection at a port of a
   Network Access Server (NAS) starts a Diameter NAS message exchange.
   Information about the call, the identity of the user, and his
   authentication information are packaged into a Diameter AA-Request
   (AAR) message and sent to a server.




Calhoun et al.             Expires August 2003                  [Page 6]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   The server processes the information and responds with a Diameter AA-
   Answer (AAA) message which contains authorization information for the
   NAS, or a failure code (Result-Code AVP).  If the value of Result-
   Code is DIAMETER_MULTI_ROUND_AUTH, an additional authentication
   exchange is indicated, and several AAR and AAA messages may be
   exchanged until the transaction completes.

   Unlike the RADIUS protocol [RADIUS], the Diameter protocol does not
   require authentication information to be contained in a request from
   the client. Therefore, it is possible to send a request for
   authorization only. The type of service depends upon the Auth-
   Request-Type AVP. This difference MAY cause operational issues in
   environments that need RADIUS interoperability, and it MAY be
   necessary that protocol conversion gateways add authentication
   information when transmitting to a RADIUS server.


2.1.  Diameter Session Establishment

   When the authentication or authorization exchange completes
   successfully, the NAS application SHOULD start a session context, and
   MAY send an Accounting START_RECORD message [Base].  The failure to
   start a session SHOULD cause an Accounting EVENT_RECORD message.


2.2.  Diameter Session Re-Authentication or Re-Authorization


   The Diameter protocol allows for users to be periodically re-
   authenticated and/or re-authorized. In such instances, the Session-Id
   AVP in the AAR message MUST be the same as the one present in the
   original authentication/authorization message. A Diameter server
   informs the NAS of the maximum time allowed before re-authentication
   or re-authorization via the Authorization-Lifetime AVP [Base].  Note,
   however, that the Authorization-Lifetime AVP SHOULD NOT be used if
   the AAR message contained a NAS-IP-Address, NAS-IPv6-Address, or NAS-
   Identifier AVP since this would mean that the NAS is using RADIUS
   which does not support server-initiated re-authentication or re-
   authorization.

   A NAS MUST re-authenticate and/or authorize after the period provided
   by the server. Furthermore, it is possible for Diameter servers to
   issue an unsolicited re-authentication and/or re-authorization by
   issuing an Re-Auth-Request message to the NAS. Upon receipt of such a
   message, the NAS is instructed to issue a request to re-authenticate
   and/or re-authorize the client.





Calhoun et al.             Expires August 2003                  [Page 7]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


2.3.  Diameter Session Termination

   When a NAS receives an indication that a user's session is being
   disconnected (e.g. LCP Terminate is received), the NAS MUST issue a
   Session-Termination-Request (STR) [Base] to its Diameter Server. This
   will ensure that any resources maintained on the servers is freed
   appropriately.

   Further, a NAS that receives a Abort-Session-Request (ASR) [Base]
   MUST issue an STR if the session requested is active, and disconnect
   the PPP (or tunneling) session.

   Termination of the session context, MUST cause the sending of an
   Accounting STOP_RECORD message [Base], if accounting is active.

   More information on Diameter Session Termination is in [Base] section
   8.4.


3.  NAS Messages

   This section defines new Diameter message Command-Code [Base] values
   that MUST be supported by all Diameter implementations that conform
   to this specification. The Command Codes are:

      Command-Name             Abbrev.    Code       Reference
      --------------------------------------------------------
      AA-Request                AAR       265          3.1
      AA-Answer                 AAA       265          3.2



3.1.  AA-Request (AAR) Command

   The AA-Request message (AAR), indicated by the Command-Code field set
   to 265 and the 'R' bit set in the Command Flags field, is used in
   order to request authentication and/or authorization for a given NAS
   user. The type of request is identified through the Auth-Request-Type
   AVP, and the default mode is both authentication and authorization.

   If Authentication is requested the User-Name attribute SHOULD be
   present, as well as any additional authentication AVPs that would
   carry the password information. A request for authorization only
   SHOULD include the information from which the authorization will be
   performed, such as the User-Name, Called-Station-Id, or Calling-
   Station-Id AVPs. All requests SHOULD contain AVPs uniquely identifing
   the source of the call, such as Origin-Host, and NAS-Port.  Certain
   networks MAY use different AVPs for authorization purposes. A request



Calhoun et al.             Expires August 2003                  [Page 8]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   for authorization will include some AVPs defined in section 6.

   It is possible for a single session to be authorized first, then
   followed by an authentication request.

   This AA-Request message MAY be the result of a multi-round
   authentication exchange, which occurs when the AA-Answer message is
   received with the Result-Code AVP set to DIAMETER_MULTI_ROUND_AUTH. A
   subsequent AAR message SHOULD be sent, with the User-Password AVP
   that includes the user's response to the prompt, and MUST include any
   State AVPs that were present in the AAA message.

   Message Format

      <AA-Request> ::= < Diameter Header: 265, REQ, PXY >
                       < Session-Id >
                       { Auth-Application-Id }
                       { Origin-Host }
                       { Origin-Realm }
                       { Destination-Realm }
                       { Auth-Request-Type }
                       [ NAS-Port ]
                       [ NAS-Port-Id ]
                       [ Origin-State-Id ]
                       [ Destination-Host ]
                       [ NAS-Identifier ]
                       [ NAS-IP-Address ]
                       [ NAS-IPv6-Address ]
                       [ NAS-Port-Type ]
                       [ Port-Limit ]
                       [ User-Name ]
                       [ User-Password ]
                       [ Service-Type ]
                       [ Idle-Timeout ]
                       [ State ]
                       [ Authorization-Lifetime ]
                       [ Auth-Grace-Period ]
                       [ Auth-Session-State ]
                       [ Session-Timeout ]
                       [ Callback-Number ]
                       [ Called-Station-Id ]
                       [ Calling-Station-Id ]
                     * [ Class ]
                       [ Originating-Line-Info ]
                       [ Connect-Info ]
                       [ CHAP-Auth ]
                       [ CHAP-Challenge ]
                     * [ Framed-Compression ]



Calhoun et al.             Expires August 2003                  [Page 9]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                       [ Framed-Interface-Id ]
                       [ Framed-IP-Address ]
                     * [ Framed-IPv6-Prefix ]
                       [ Framed-IP-Netmask ]
                       [ Framed-MTU ]
                       [ Framed-Protocol ]
                       [ ARAP-Password ]
                       [ ARAP-Security ]
                     * [ ARAP-Security-Data ]
                     * [ Login-IP-Host ]
                     * [ Login-IPv6-Host ]
                       [ Login-LAT-Group ]
                       [ Login-LAT-Node ]
                       [ Login-LAT-Port ]
                       [ Login-LAT-Service ]
                     * [ Tunneling ]
                     * [ Proxy-Info ]
                     * [ Route-Record ]
                     * [ AVP ]


3.2.  AA-Answer (AAA) Command

   The AA-Answer (AAA) message, is indicated by the Command-Code field
   set to 265 and the 'R' bit cleared in the Command Flags field, is
   sent in response to the AA-Request message. If authorization was
   requested, a successful response will include the authorization AVPs
   appropriate for the service being provided, as defined in section 6.

   For authentication exchanges that require more than a single round
   trip, the server MUST set the Result-Code AVP to
   DIAMETER_MULTI_ROUND_AUTH. An AAA message with this result code MAY
   include one or more Reply-Message and MAY include zero or one State
   AVPs.

   If the Reply-Message AVP was present, the access device SHOULD
   display the text message to the user, and MUST prompt the user for a
   response.  If the access device is unable to prompt the user for a
   new response, which could be achieved via PAP, it MUST treat this
   answer as an error, and deny access.











Calhoun et al.             Expires August 2003                 [Page 10]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Message Format

      <AA-Answer> ::= < Diameter Header: 265, PXY >
                      < Session-Id >
                      { Auth-Application-Id }
                      { Auth-Request-Type }
                      { Result-Code }
                      { Origin-Host }
                      { Origin-Realm }
                      [ User-Name ]
                      [ Service-Type ]
                    * [ Class ]
                    * [ Configuration-Token ]
                      [ Acct-Interim-Interval ]
                      [ Error-Message ]
                      [ Error-Reporting-Host ]
                      [ Idle-Timeout ]
                      [ Authorization-Lifetime ]
                      [ Auth-Grace-Period ]
                      [ Auth-Session-State ]
                      [ Re-Auth-Request-Type ]
                      [ Session-Timeout ]
                      [ State ]
                    * [ Reply-Message ]
                      [ Termination-Action ]
                      [ Origin-State-Id ]
                    * [ Filter-Id ]
                      [ Password-Retry ]
                      [ Port-Limit ]
                      [ Prompt ]
                      [ ARAP-Challenge-Response ]
                      [ ARAP-Features ]
                      [ ARAP-Security ]
                    * [ ARAP-Security-Data ]
                      [ ARAP-Zone-Access ]
                      [ Callback-Id ]
                      [ Callback-Number ]
                      [ Framed-Appletalk-Link ]
                    * [ Framed-Appletalk-Network ]
                      [ Framed-Appletalk-Zone ]
                    * [ Framed-Compression ]
                      [ Framed-Interface-Id ]
                      [ Framed-IP-Address ]
                    * [ Framed-IPv6-Prefix ]
                      [ Framed-IPv6-Pool ]
                    * [ Framed-IPv6-Route ]
                      [ Framed-IP-Netmask ]
                    * [ Framed-Route ]



Calhoun et al.             Expires August 2003                 [Page 11]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                      [ Framed-Pool ]
                      [ Framed-IPX-Network ]
                      [ Framed-MTU ]
                      [ Framed-Protocol ]
                      [ Framed-Routing ]
                    * [ Login-IP-Host ]
                    * [ Login-IPv6-Host ]
                      [ Login-LAT-Group ]
                      [ Login-LAT-Node ]
                      [ Login-LAT-Port ]
                      [ Login-LAT-Service ]
                      [ Login-Service ]
                      [ Login-TCP-Port ]
                    * [ NAS-Filter-Rule ]
                    * [ Tunneling ]
                    * [ Redirect-Host ]
                      [ Redirect-Host-Usage ]
                      [ Redirect-Max-Cache-Time ]
                    * [ Proxy-Info ]
                    * [ AVP ]


4.  NAS Session AVPs

   Diameter reserves the AVP Codes 0-255 for RADIUS functions that are
   implemented in Diameter.

   AVPs new to Diameter have code values 256 and greater. A Diameter
   message that includes one of these AVPs MAY cause interoperability
   issues should the request traverse a AAA node that only supports the
   RADIUS protocol. However, the Diameter protocol should not be
   hampered from future developments due to the existing installed base.

   There are some RADIUS attributes that are not allowed or supported
   directly in Diameter. See section 9 below for more information.


4.1.  Call and Session Information

   This section contains the NAS unique AVPs that are needed to identify
   call and session context information, and allows the server to set
   constraints on a session.

   These AVPs are used in addition to the Base AVPs of:
      Session-Id
      Auth-Application-Id
      Origin-Host
      Origin-Realm



Calhoun et al.             Expires August 2003                 [Page 12]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      Auth-Request-Type

   Common session status AVPs are listed here too.

The following table describes the Session level AVPs, their AVP Code
values, types, possible flag values and whether the AVP MAY be
encrypted.
                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|    |
   Attribute Name  Code Defined  Value Type |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   NAS-Port           5   4.2    Unsigned32 | M  |  P  |    |  V  | Y  |
   NAS-Port-Id       87   4.3    UTF8String | M  |  P  |    |  V  | Y  |
   NAS-Port-Type     61   4.4    Enumerated | M  |  P  |    |  V  | Y  |
   Called-Station-Id 30   4.5    UTF8String | M  |  P  |    |  V  | Y  |
   Calling-Station-  31   4.6    UTF8String | M  |  P  |    |  V  | Y  |
     Id                                     |    |     |    |     |    |
   Connect-Info      77   4.7    UTF8String | M  |  P  |    |  V  | Y  |
   Originating-Line- 94   4.8    OctetString|    | M,P |    |  V  | Y  |
     Info                                   |    |     |    |     |    |
   Reply-Message     18   4.9    UTF8String | M  |  P  |    |  V  | Y  |
   Termination-      29   4.10   Enumerated | M  |  P  |    |  V  | Y  |
     Action                                 |    |     |    |     |    |
   -----------------------------------------|----+-----+----+-----|----|



4.2.  NAS-Port AVP

   The NAS-Port AVP (AVP Code 5) is of type Unsigned32 and contains the
   physical or virtual port number of the NAS which is authenticating
   the user. Note that this is using "port" in its sense of a service
   connection on the NAS, not in the sense of an IP protocol identifier.

   Either NAS-Port or NAS-Port-Id (AVP Code 87) SHOULD be present in AA-
   Request commands if the NAS differentiates among its ports.



4.3.  NAS-Port-Id AVP

   The NAS-Port-Id AVP (AVP Code 87) is of type UTF8String and consists
   of ASCII text that identifies the port of the NAS which is
   authenticating the user.  Note that this is using "port" in its sense
   of a service connection on the NAS, not in the sense of an IP
   protocol identifier.



Calhoun et al.             Expires August 2003                 [Page 13]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Either NAS-Port or NAS-Port-Id SHOULD be present in AA-Request
   commands if the NAS differentiates among its ports.  NAS-Port-Id is
   intended for use by NASes which cannot conveniently number their
   ports.



4.4.  NAS-Port-Type AVP

   The NAS-Port-Type AVP (AVP Code 61) is of type Enumerated and
   contains the type of the port on which the NAS is authenticating the
   user.  This AVP SHOULD be present if the NAS uses the same NAS-Port
   number ranges for different service types concurrently.

   The supported values are defined in [RADIUSTypes]. The following list
   is informational:

        0   Async
        1   Sync
        2   ISDN Sync
        3   ISDN Async V.120
        4   ISDN Async V.110
        5   Virtual
        6   PIAFS
        7   HDLC Clear Channel
        8   X.25
        9   X.75
       10   G.3 Fax
       11   SDSL - Symmetric DSL
       12   ADSL-CAP - Asymmetric DSL, Carrierless Amplitude Phase
               Modulation
       13   ADSL-DMT - Asymmetric DSL, Discrete Multi-Tone
       14   IDSL - ISDN Digital Subscriber Line
       15   Ethernet
       16   xDSL - Digital Subscriber Line of unknown type
       17   Cable
       18   Wireless - Other
       19   Wireless - IEEE 802.11


4.5.  Called-Station-Id AVP


   The Called-Station-Id AVP (AVP Code 30) is of type UTF8String, and
   allows the NAS to send in the request, the ASCII string of the phone
   number that the user called, using Dialed Number Identification
   (DNIS) or a similar technology. Note that this may be different from
   the phone number the call comes in on. It SHOULD only be present in



Calhoun et al.             Expires August 2003                 [Page 14]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   authentication and/or authorization requests.

   If the Auth-Request-Type AVP is set to authorization-only and the
   User-Name AVP is absent, the Diameter Server MAY perform
   authorization based on this field. This can be used by a NAS to
   request whether a call should be answered based on the DNIS.

   The codification of the range of allowed usage of this field is
   outside the scope of this specification.



4.6.  Calling-Station-Id AVP

   The Calling-Station-Id AVP (AVP Code 31) is of type UTF8String, and
   allows the NAS to send in the request the the ASCII string of the
   phone number that the call came from, using Automatic Number
   Identification (ANI) or a similar technology. It SHOULD only be
   present in authentication and/or authorization requests.

   If the Auth-Request-Type AVP is set to authorization-only and the
   User-Name AVP is absent, the Diameter Server MAY perform
   authorization based on this field. This can be used by a NAS to
   request whether a call should be answered based on the ANI.

   The codification of the range of allowed usage of this field is
   outside the scope of this specification.


4.7.  Connect-Info AVP

   The Connect-Info AVP (AVP Code 77) is of type UTF8String and is sent
   in the AA-Request message, and indicates the nature of the user's
   connection. The connection speed SHOULD be included at the beginning
   of the first Connect-Info AVP in the message.  If the transmit and
   receive connection speeds differ, they may both be included in the
   first AVP with the transmit speed first (the speed the NAS modem
   transmits at), a slash (/), the receive speed, then optionally other
   information.

   For example, "28800 V42BIS/LAPM" or "52000/31200 V90"



4.8.  Originating-Line-Info AVP

   The Originating-Line-Info AVP (AVP Code 94 is of type OctetString and
   is sent by the NAS system to convey information about the origin of



Calhoun et al.             Expires August 2003                 [Page 15]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   the call from an SS7 system.


   The originating line information (OLI) information element indicates
   the nature and/or characteristics of the line from which a call
   originated (e.g. payphone, hotel, cellular). Telephone companies are
   starting to offer OLI to their customers as an option over Primary
   Rate Interface (PRI). Internet Service Providers (ISPs) can use OLI
   in addition to Called-Station-Id and Calling-Station-Id attributes to
   differentiate customer calls and define different services


   The Value field contains two octets (00-99). ANSI T1.113 and BELLCORE
   394 can be used for additional information about those values and
   their use.  For more information on current assignment values see
   [ANITypes].

    Value   Description
   ------------------------------------------------------------
      00    Plain Old Telephone Service (POTS)
      01    Multiparty line (more than 2)
      02    ANI Failure
      03    ANI Observed
      04    ONI Observed
      05    ANI Failure Observed
      06    Station Level Rating
      07    Special Operator Handling Required
      08    InterLATA Restricted
      10    Test Call
      20    Automatic Identified Outward Dialing (AIOD)
      23    Coin or Non-Coin
      24    Toll Free Service (Non-Pay origination)
      25    Toll Free Service (Pay origination)
      27    Toll Free Service (Coin Control origination)
      29    Prison/Inmate Service
      30-32 Intercept
      30    Intercept (blank)
      31    Intercept (trouble)
      32    Intercept (regular)
      34    Telco Operator Handled Call
      40-49 Unrestricted Use
      52    Outward Wide Area Telecommunications Service (OUTWATS)
      60    Telecommunications Relay Service (TRS)(Unrestricted)
      61    Cellular/Wireless PCS (Type 1)
      62    Cellular/Wireless PCS (Type 2)
      63    Cellular/Wireless PCS (Roaming)
      66    TRS (Hotel)
      67    TRS (Restricted)



Calhoun et al.             Expires August 2003                 [Page 16]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      70    Pay Station, No coin control
      93    Access for private virtual network service


4.9.  Reply-Message AVP

   The Reply-Message AVP (AVP Code 18) is of type UTF8String, and
   contains text which MAY be displayed to the user.  When used in an
   AA-Answer message with a successful Result-Code AVP it indicates a
   success message. When found in the same message with a Result-Code
   other than Diameter-SUCCESS it contains a failure message.

   The Reply-Message AVP MAY indicate a dialog message to prompt the
   user before another AA-Request attempt. When used in an AA-Answer, it
   MAY indicate a dialog message to prompt the user for a response.

   Multiple Reply-Message's MAY be included and if any are displayed,
   they MUST be displayed in the same order as they appear in the
   message.



4.10.  Termination-Action AVP

   The Termination-Action AVP is of type Enumerated and indicates what
   action the NAS should take when the specified service is completed.
   This AVP SHOULD only be present in authorization responses. The
   following values are supported as listed in [RADIUSTypes]:

      DEFAULT                    0
         Upon termination of the authorized service the NAS MUST
         terminate the current session.

      AA-REQUEST                 1
         Upon termination of the authorized service the NAS MAY send a
         new AA-Request (AAR) command.  When the authorized service
         terminates, the NAS SHOULD NOT terminate the session or
         generate a Session-Termination-Request (STR) command.  Instead,
         it SHOULD generate a new AAR command which contains the same
         value of the Session-Id AVP it sent in the previous AAR
         command.  It SHOULD also include the State AVP from the
         previous AA-Answer (AAA) command if it contained one.

         An exception to this rule applies, however, if the authorized
         service terminates due to the expiry of the Session-Timeout
         AVP.  In this case, the NAS MUST terminate the expired session
         and MAY generate a new AAR command with a new Session-Id.




Calhoun et al.             Expires August 2003                 [Page 17]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Note: The Termination-Action AVP is typically used for the login
   service (Service-Type = 1 or "Login") or by 802.1X supplicants
   [RAD802.1X] (e.g., NAS-Port-Type = 19 or "Wireless - IEEE 802.11").

   When used for the login service, the service typically terminates
   when the login host clears the connection.  The NAS may prompt the
   user for a new connection and issue a new AA-Request.

   When used by 802.1X supplicants, the service typically terminates due
   to the expiry of the Session-Timeout AVP.  The access device may then
   reauthenticate the user with a new AA-Request.  The RECOMMENDED way
   to do this in Diameter is to use the Authorization-Lifetime AVP
   rather than the Termination-Action AVP.  However, the Termination-
   Action AVP MAY be used when copied from a RADIUS Access-Accept to a
   Diameter AA-Answer by a Translation Agent.


5.  NAS Authentication AVPs

   This section defines the AVPs that are necessary to carry the
   authentication information in the Diameter protocol. The
   functionality defined here provides a RADIUS-like AAA service, over a
   more reliable and secure transport, as defined in the base protocol
   [Base].

   The following table describes the AVPs, their AVP Code values, types,
   possible flag values and whether the AVP MAY be encrypted.
























Calhoun et al.             Expires August 2003                 [Page 18]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|    |
   Attribute Name  Code Defined  Value Type |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   User-Password      2   5.1    OctetString| M  |  P  |    |  V  | Y  |
   Password-Retry    75   5.2    Unsigned32 | M  |  P  |    |  V  | Y  |
   Prompt            76   5.3    Enumerated | M  |  P  |    |  V  | Y  |
   CHAP-Auth        402   5.4    Grouped    | M  |  P  |    |  V  | Y  |
   CHAP-Algorithm   403   5.5    Enumerated | M  |  P  |    |  V  | Y  |
   CHAP-Ident       404   5.6    OctetString| M  |  P  |    |  V  | Y  |
   CHAP-Response    405   5.7    OctetString| M  |  P  |    |  V  | Y  |
   CHAP-Challenge    60   5.8    OctetString| M  |  P  |    |  V  | Y  |
   ARAP-Password     70   5.9    OctetString| M  |  P  |    |  V  | Y  |
   ARAP-Challenge-   84   5.10   OctetString| M  |  P  |    |  V  | Y  |
     Response                               |    |     |    |     |    |
   ARAP-Security     73   5.11   Unsigned32 | M  |  P  |    |  V  | Y  |
   ARAP-Security-    74   5.12   OctetString| M  |  P  |    |  V  | Y  |
     Data                                   |    |     |    |     |    |
   -----------------------------------------|----+-----+----+-----|----|


5.1.  User-Password AVP

   The User-Password AVP (AVP Code 2) is of type OctetString and
   contains the password of the user to be authenticated, or the user's
   input in a multi-round authentication exchange.

   The User-Password AVP contains a user password or one-time password
   and therefore represents sensitive information. As required in
   [Base], Diameter messages are encrypted using IPsec or TLS. Unless
   this AVP is used for one-time passwords, the User- Password AVP
   SHOULD NOT be used in untrusted proxy environments without encrypting
   it using end-to-end security techniques, such as CMS Security
   [DiamCMS].

   The clear-text password (prior to encryption) MUST NOT be longer than
   128 bytes in length.


5.2.  Password-Retry AVP

   The Password-Retry AVP (AVP Code 75) is of type Unsigned32 and MAY be
   included in the AA-Answer if the Result-Code indicates an
   authentication failure. The value of this AVP indicates how many
   authentication attempts a user may be permitted before being
   disconnected. This AVP is primarily intended for use when the Framed-



Calhoun et al.             Expires August 2003                 [Page 19]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Protocol AVP (see Section 6.9.1) is set to ARAP.


5.3.  Prompt AVP

   The Prompt AVP (AVP Code 76) is of type Enumerated, and MAY be
   present in the AA-Answer message. When present, it is used by the NAS
   to determine whether the user's response, when entered, should be
   echoed.

   The supported values are listed in [RADIUSTypes].  The following list
   is informational:

       0  No Echo
       1  Echo


5.4.  CHAP-Auth AVP

   The CHAP-Auth AVP (AVP Code 402) is of type Grouped and contains the
   information necessary to authenticate a user using the PPP Challenge-
   Handshake Authentication Protocol (CHAP) [PPPCHAP]. If the CHAP-Auth
   AVP is found in a message, the CHAP-Challenge AVP MUST be present as
   well. The optional AVPs containing the CHAP response depend upon the
   value of the CHAP-Algorithm AVP. The grouped AVP has the following
   ABNF grammar:

      CHAP-Auth  ::= < AVP Header: 402 >
                     { CHAP-Algorithm }
                     { CHAP-Ident }
                     [ CHAP-Response ]
                   * [ AVP ]


5.5.  CHAP-Algorithm AVP

   The CHAP-Algorithm AVP (AVP Code 403) is of type Enumerated and
   contains the algorithm identifier used in the computation of the CHAP
   response [PPPCHAP]. The following values are currently supported:

      CHAP with MD5       5
         The CHAP response is computed using the procedure described in
         [PPPCHAP].  This algorithm requires that CHAP-Response AVP MUST
         be present in the CHAP-Auth AVP.







Calhoun et al.             Expires August 2003                 [Page 20]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


5.6.  CHAP-Ident AVP

   The CHAP-Ident AVP (AVP Code 404) is of type OctetString and contains
   the one octet CHAP Identifier used in the computation of the CHAP
   response [PPPCHAP].


5.7.  CHAP-Response AVP

   The CHAP-Response AVP (AVP Code 405) is of type OctetString and
   contains the 16 octet authentication data provided by the user in
   response to the CHAP challenge [PPPCHAP].


5.8.  CHAP-Challenge AVP

   The CHAP-Challenge AVP (AVP Code 60) is of type OctetString and
   contains the CHAP Challenge sent by the NAS to the CHAP peer
   [PPPCHAP].


5.9.  ARAP-Password AVP

   The ARAP-Password AVP (AVP Code 70) is of type OctetString and is
   only present when the Framed-Protocol AVP (see Section 6.9.1) is
   included in the message and is set to ARAP. This AVP MUST NOT be
   present if either the User-Password or the CHAP-Auth AVP is present.
   See [RADIUSExt] for more information on the contents of this AVP.


5.10.  ARAP-Challenge-Response AVP

   The ARAP-Challenge-Response AVP (AVP Code 84) is of type OctetString
   and is only present when the Framed-Protocol AVP (see Section 6.9.1)
   is included in the message and is set to ARAP. This AVP contains an 8
   octet response to the dial-in client's challenge. The RADIUS server
   calculates this value by taking the dial-in client's challenge from
   the high order 8 octets of the ARAP-Password AVP and performing DES
   encryption on this value with the authenticating user's password as
   the key. If the user's password is less than 8 octets in length, the
   password is padded at the end with NULL octets to a length of 8
   before using it as a key.


5.11.  ARAP-Security AVP

   The ARAP-Security AVP (AVP Code 73) is of type Unsigned32, and MAY be
   present in the AA-Answer message if the Framed-Protocol AVP (see



Calhoun et al.             Expires August 2003                 [Page 21]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Section 6.9.1) is set to the value of ARAP, and the Result-Code AVP
   is set to DIAMETER_MULTI_ROUND_AUTH.  See [RADIUSExt] for more
   information on the format of this AVP.


5.12.  ARAP-Security-Data AVP

   The ARAP-Security AVP (AVP Code 74) is of type OctetString, and MAY
   be present in the AA-Request or AA-Answer message if the Framed-
   Protocol AVP is set to the value of ARAP, and the Result-Code AVP is
   set to DIAMETER_MULTI_ROUND_AUTH. This AVP contains the security
   module challenge or response associated with the ARAP Security Module
   specified in ARAP-Security.


6.  NAS Authorization AVPs

   This section contains the authorization AVPs that are supported in
   the NAS Application. The Service-Type AVP SHOULD be present in all
   messages, and based on its value, additional AVPs defined in this
   section and section 7 MAY be present.

   Due to space constraints, the short form IPFiltrRule is used to
   represent IPFilterRule.
                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|    |
   Attribute Name  Code Defined  Value Type |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Service-Type       6   6.1    Enumerated | M  |  P  |    |  V  | Y  |
   Callback-Number   19   6.2    UTF8String | M  |  P  |    |  V  | Y  |
   Callback-Id       20   6.3    UTF8String | M  |  P  |    |  V  | Y  |
   Idle-Timeout      28   6.4    Unsigned32 | M  |  P  |    |  V  | Y  |
   Port-Limit        62   6.5    Unsigned32 | M  |  P  |    |  V  | Y  |
   NAS-Filter-Rule  400   6.6    IPFiltrRule| M  |  P  |    |  V  | Y  |
   Filter-Id         11   6.7    UTF8String | M  |  P  |    |  V  | Y  |
   Configuration-    78   6.8    OctetString| M  |     |    | P,V |    |
     Token                                  |    |     |    |     |    |
   Framed-Protocol    7  6.9.1   Enumerated | M  |  P  |    |  V  | Y  |
   Framed-Routing    10  6.9.2   Enumerated | M  |  P  |    |  V  | Y  |
   Framed-MTU        12  6.9.3   Unsigned32 | M  |  P  |    |  V  | Y  |
   Framed-           13  6.9.4   Enumerated | M  |  P  |    |  V  | Y  |
     Compression                            |    |     |    |     |    |
   Framed-IP-Address  8  6.10.1  OctetString| M  |  P  |    |  V  | Y  |
   Framed-IP-Netmask  9  6.10.2  OctetString| M  |  P  |    |  V  | Y  |
   Framed-Route      22  6.10.3  UTF8String | M  |  P  |    |  V  | Y  |
   Framed-Pool       88  6.10.4  OctetString| M  |  P  |    |  V  | Y  |



Calhoun et al.             Expires August 2003                 [Page 22]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Framed-           96  6.10.5  Unsigned64 | M  |  P  |    |  V  | Y  |
     Interface-Id                           |    |     |    |     |    |
   Framed-IPv6-      97  6.10.6  OctetString| M  |  P  |    |  V  | Y  |
     Prefix                                 |    |     |    |     |    |
   Framed-IPv6-      99  6.10.7  UTF8String | M  |  P  |    |  V  | Y  |
     Route                                  |    |     |    |     |    |
   Framed-IPv6-Pool 100  6.10.8  OctetString| M  |  P  |    |  V  | Y  |
   Framed-IPX-       23  6.11.1  UTF8String | M  |  P  |    |  V  | Y  |
     Network                                |    |     |    |     |    |
   Framed-Appletalk- 37  6.12.1  Unsigned32 | M  |  P  |    |  V  | Y  |
     Link                                   |    |     |    |     |    |
   Framed-Appletalk- 38  6.12.2  Unsigned32 | M  |  P  |    |  V  | Y  |
     Network                                |    |     |    |     |    |
   Framed-Appletalk- 39  6.12.3  OctetString| M  |  P  |    |  V  | Y  |
     Zone                                   |    |     |    |     |    |
   ARAP-Features     71  6.13.1  OctetString| M  |  P  |    |  V  | Y  |
   ARAP-Zone-Access  72  6.13.2  Enumerated | M  |  P  |    |  V  | Y  |
   Login-IP-Host     14  6.14.1  OctetString| M  |  P  |    |  V  | Y  |
   Login-IPv6-Host   98  6.14.2  OctetString| M  |  P  |    |  V  | Y  |
   Login-Service     15  6.14.3  Enumerated | M  |  P  |    |  V  | Y  |
   Login-TCP-Port    16  6.15.1  Unsigned32 | M  |  P  |    |  V  | Y  |
   Login-LAT-Service 34  6.16.1  OctetString| M  |  P  |    |  V  | Y  |
   Login-LAT-Node    35  6.16.2  OctetString| M  |  P  |    |  V  | Y  |
   Login-LAT-Group   36  6.16.3  OctetString| M  |  P  |    |  V  | Y  |
   Login-LAT-Port    63  6.16.4  OctetString| M  |  P  |    |  V  | Y  |
   -----------------------------------------|----+-----+----+-----|----|


6.1.  Service-Type AVP

   The Service-Type AVP (AVP Code 6) is of type Enumerated and contains
   the type of service the user has requested, or the type of service to
   be provided.  One such AVP MAY be present in an authentication and/or
   authorization request or response. A NAS is not required to implement
   all of these service types, and MUST treat unknown or unsupported
   Service-Types as though a response with a Result-Code other than
   Diameter-SUCCESS had been received instead.

   When used in a request, the Service-Type AVP SHOULD be considered to
   be a hint to the server that the NAS has reason to believe the user
   would prefer the kind of service indicated, but the server is not
   required to honor the hint. The following values have been defined
   for the Service-Type AVP:

   The complete list of defined values can be found in [RADIUS] and
   [RADIUSTypes].  The following list is informational:





Calhoun et al.             Expires August 2003                 [Page 23]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


       1  Login
       2  Framed
       3  Callback Login
       4  Callback Framed
       5  Outbound
       6  Administrative
       7  NAS Prompt
       8  Authenticate Only
       9  Callback NAS Prompt
      10  Call Check
      11  Callback Administrative
      12  Voice
      13  Fax
      14  Modem Relay

   The following values are further qualified:

      Login               1
         The user should be connected to a host. The message MAY include
         additional AVPs defined in sections 6.15 or 6.16.

      Framed              2
         A Framed Protocol should be started for the User, such as PPP
         or SLIP. The message MAY include additional AVPs defined in
         sections 6.9, or 7 for tunneling services.

      Callback Login      3
         The user should be disconnected and called back, then connected
         to a host. The message MAY include additional AVPs defined in
         this section.

      Callback Framed     4
         The user should be disconnected and called back, then a Framed
         Protocol should be started for the User, such as PPP or SLIP.
         The message MAY include additional AVPs defined in sections
         6.9, or 7 for tunneling services.


6.2.  Callback-Number AVP

   The Callback-Number AVP (AVP Code 19) is of type UTF8String, and
   contains a dialing string to be used for callback.  It MAY be used in
   an authentication and/or authorization request as a hint to the
   server that a Callback service is desired, but the server is not
   required to honor the hint in the corresponding response.

   The codification of the range of allowed usage of this field is
   outside the scope of this specification.



Calhoun et al.             Expires August 2003                 [Page 24]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.3.  Callback-Id AVP

   The Callback-Id AVP (AVP Code 20) is of type UTF8String, and contains
   the name of a place to be called, to be interpreted by the NAS. This
   AVP MAY be present in an authentication and/or authorization
   response.

   This AVP is not roaming-friendly since it assumes that the Callback-
   Id is configured on the NAS. It is therefore preferable to use the
   Callback-Number AVP instead.


6.4.  Idle-Timeout AVP

   The Idle-Timeout AVP (AVP Code 28) is of type Unsigned32 and sets the
   maximum number of consecutive seconds of idle connection allowed to
   the user before termination of the session or prompt. It MAY be used
   in an authentication and/or authorization request (or challenge) as a
   hint to the server that an idle timeout is desired, but the server is
   not required to honor the hint in the corresponding response.


6.5.  Port-Limit AVP

   The Port-Limit AVP (AVP Code 62) is of type Unsigned32 and sets the
   maximum number of ports to be provided to the user by the NAS.  It
   MAY be used in an authentication and/or authorization request as a
   hint to the server that multilink PPP [PPPMP] service is desired, but
   the server is not required to honor the hint in the corresponding
   response.



6.6.  NAS-Filter-Rule AVP

   The NAS-Filter-Rule AVP (AVP Code 400) is of type IPFilterRule, and
   provides filter rules that need to be configured on the NAS for the
   user. One or more such AVPs MAY be present in an authorization
   response.


6.7.  Filter-Id AVP

   The Filter-Id AVP (AVP Code 11) is of type UTF8String, and contains
   the name of the filter list for this user. Zero or more Filter-Id
   AVPs MAY be sent in an authorization answer.

   Identifying a filter list by name allows the filter to be used on



Calhoun et al.             Expires August 2003                 [Page 25]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   different NASes without regard to filter-list implementation details.
   However, this AVP is not roaming friendly since filter naming differs
   from one service provider to another.

   In non-RADIUS environments, it is RECOMMENDED that the NAS-Filter-
   Rule AVP be used instead.


6.8.  Configuration-Token AVP

   The Configuration-Token AVP (AVP Code 78) is of type OctetString and
   is sent by a Diameter Server to a Diameter Proxy Agent or Translation
   Agent in an AA-Answer command to indicate a type of user profile to
   be used.  It should not be sent to a Diameter Client (NAS).

   The format of the Data field of this AVP is site specific.



6.9.  Framed Access Authorization AVPs

   This section contains the authorization AVPs that are necessary to
   support framed access, such as PPP, SLIP, etc. AVPs defined in this
   section MAY be present in a message if the Service-Type AVP was set
   to "Framed" or "Callback Framed".


6.9.1.  Framed-Protocol AVP

   The Framed-Protocol AVP (AVP Code 7) is of type Enumerated and
   contains the framing to be used for framed access. This AVP MAY be
   present in both requests and responses. The supported values are
   listed in [RADIUSTypes].  The following list is informational:

       1  PPP
       2  SLIP
       3  AppleTalk Remote Access Protocol (ARAP)
       4  Gandalf proprietary SingleLink/MultiLink protocol
       5  Xylogics proprietary IPX/SLIP
       6  X.75 Synchronous



6.9.2.  Framed-Routing AVP

   The Framed-Routing AVP (AVP Code 10) is of type Enumerated and
   contains the routing method for the user, when the user is a router
   to a network.  This AVP SHOULD only be present in authorization



Calhoun et al.             Expires August 2003                 [Page 26]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   responses. The supported values are listed in [RADIUSTypes].      The
   following list is informational:

      0  None
      1  Send routing packets
      2  Listen for routing packets
      3  Send and Listen


6.9.3.  Framed-MTU AVP

   The Framed-MTU AVP (AVP Code 12) is of type Unsigned32 and contains
   the Maximum Transmission Unit to be configured for the user, when it
   is not negotiated by some other means (such as PPP). This AVP SHOULD
   only be present in authorization responses. The MTU value MUST be in
   the range of 64 and 65535.


6.9.4.  Framed-Compression AVP

   The Framed-Compression AVP (AVP Code 13) is of type Enumerated and
   contains the compression protocol to be used for the link. It MAY be
   used in an authorization request as a hint to the server that a
   specific compression type is desired, but the server is not required
   to honor the hint in the corresponding response.

   More than one compression protocol AVP MAY be sent. It is the
   responsibility of the NAS to apply the proper compression protocol to
   appropriate link traffic.

   The supported values are listed in [RADIUSTypes].  The following list
   is informational:

       0  None
       1  VJ TCP/IP header compression
       2  IPX header compression
       3  Stac-LZS compression


6.10.  IP Access

   The AVPs defined in this section are used when the user requests, or
   is being granted, access to IP. They are only present if the Framed-
   Protocol AVP (see Section 6.9.1) is set to PPP, SLIP, Gandalf
   proprietarySingleLink/MultiLink protocol, or X.75 Synchronous.






Calhoun et al.             Expires August 2003                 [Page 27]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.10.1.  Framed-IP-Address AVP

   The Framed-IP-Address AVP (AVP Code 8) [RADIUS] is of type
   OctetString and contains an IPv4 address, of the type specified in
   the attribute value, to be configured for the user. It MAY be used in
   an authorization request as a hint to the server that a specific
   address is desired, but the server is not required to honor the hint
   in the corresponding response.

   Two IPv4 addresses have special significance; 0xFFFFFFFF and
   0xFFFFFFFE.  The value 0xFFFFFFFF indicates that the NAS should allow
   the user to select an address (e.g. Negotiated). The value 0xFFFFFFFE
   indicates that the NAS should select an address for the user (e.g.
   Assigned from a pool of addresses kept by the NAS).


6.10.2.  Framed-IP-Netmask AVP

   The Framed-IP-Netmask AVP (AVP Code 9) is of type OctetString and
   contains the four octets of the IPv4 netmask to be configured for the
   user when the user is a router to a network.  It MAY be used in an
   authorization request as a hint to the server that a specific netmask
   is desired, but the server is not required to honor the hint in the
   corresponding response. This AVP MUST be present in a response if the
   request included this AVP with a value of 0xFFFFFFFF.


6.10.3.  Framed-Route AVP

   The Framed-Route AVP (AVP Code 22) is of type UTF8String, and
   contains the ASCII routing information to be configured for the user
   on the NAS. Zero or more such AVPs MAY be present in an authorization
   response.

   The string MUST contain a destination prefix in dotted quad form
   optionally followed by a slash and a decimal length specifier stating
   how many high order bits of the prefix should be used. That is
   followed by a space, a gateway address in dotted quad form, a space,
   and one or more metrics separated by spaces. For example,
   "192.168.1.0/24 192.168.1.1 1".

   The length specifier may be omitted in which case it should default
   to 8 bits for class A prefixes, 16 bits for class B prefixes, and 24
   bits for class C prefixes. For example, "192.168.1.0 192.168.1.1 1".

   Whenever the gateway address is specified as "0.0.0.0" the IP address
   of the user SHOULD be used as the gateway address.




Calhoun et al.             Expires August 2003                 [Page 28]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.10.4.  Framed-Pool AVP

   The Framed-Pool AVP (AVP Code 88) is of type OctetString and contains
   the name of an assigned address pool that SHOULD be used to assign an
   address for the user.  If a NAS does not support multiple address
   pools, the NAS SHOULD ignore this AVP.  Address pools are usually
   used for IP addresses, but can be used for other protocols if the NAS
   supports pools for those protocols.

   Although specified as type OctetString for compatibility with RADIUS
   [RADIUSExt], the encoding of the Data field SHOULD also conform to
   the rules for the UTF8String Data Format.


6.10.5.  Framed-Interface-Id AVP

   The Framed-Interface-Id AVP (AVP Code 96) is of type Unsigned64 and
   contains the IPv6 interface identifier to be configured for the user.
   It MAY be used in authorization requests as a hint to the server that
   a specific interface id is desired, but the server is not required to
   honor the hint in the corresponding response.


6.10.6.  Framed-IPv6-Prefix AVP

   The Framed-IPv6-Prefix AVP (AVP Code 97) is of type OctetString and
   contains the IPv6 prefix to be configured for the user. One or more
   AVPs MAY be used in authorization requests as a hint to the server
   that a specific IPv6 prefixes are desired, but the server is not
   required to honor the hint in the corresponding response.


6.10.7.  Framed-IPv6-Route AVP

   The Framed-IPv6-Route AVP (AVP Code 99) is of type UTF8String, and
   contains the ASCII routing information to be configured for the user
   on the NAS. Zero or more such AVPs MAY be present in an authorization
   response.

   The string MUST contain an IPv6 address prefix followed by a slash
   and a decimal length specifier stating how many high order bits of
   the prefix should be used. That is followed by a space, a gateway
   address in hexadecimal notation, a space, and one or more metrics
   separated by spaces. For example:
      "2000:0:0:106::/64 2000::106:a00:20ff:fe99:a998 1".

   Whenever the gateway address is the IPv6 unspecified address the IP
   address of the user SHOULD be used as the gateway address, such as:



Calhoun et al.             Expires August 2003                 [Page 29]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      "2000:0:0:106::/64 :: 1".


6.10.8.  Framed-IPv6-Pool AVP

   The Framed-IPv6-Pool AVP (AVP Code 100) is of type OctetString, and
   contains the name of an assigned pool that SHOULD be used to assign
   an IPv6 prefix for the user. If the access device does not support
   multiple prefix pools, it MUST ignore this AVP.

   Although specified as type OctetString for compatibility with RADIUS
   [RADIUSIPv6], the encoding of the Data field SHOULD also conform to
   the rules for the UTF8String Data Format.



6.11.  IPX Access

   The AVPs defined in this section are used when the user requests, or
   is being granted, access to IPX. They are only present if the Framed-
   Protocol AVP (see Section 6.9.1) is set to PPP, Xylogics proprietary
   IPX/SLIP, Gandalf proprietarySingleLink/MultiLink protocol, or X.75
   Synchronous.


6.11.1.  Framed-IPX-Network AVP

   The Framed-IPX-Network AVP (AVP Code 23) is of type UTF8String, and
   contains the IPX Network number to be configured for the user. It MAY
   be used in an authorization request as a hint to the server that a
   specific address is desired, but the server is not required to honor
   the hint in the corresponding response.

   Two addresses have special significance; 0xFFFFFFFF and 0xFFFFFFFE.
   The value 0xFFFFFFFF indicates that the NAS should allow the user to
   select an address (e.g. Negotiated). The value 0xFFFFFFFE indicates
   that the NAS should select an address for the user (e.g. assigned
   from a pool of one or more IPX networks kept by the NAS).


6.12.  Appletalk Access

   The AVPs defined in this section are used when the user requests, or
   is being granted, access to Appletalk. They are only present if the
   Framed-Protocol AVP (see Section 6.9.1) is set to PPP, Gandalf
   proprietary, SingleLink/MultiLink protocol, or X.75 Synchronous.





Calhoun et al.             Expires August 2003                 [Page 30]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.12.1.  Framed-AppleTalk-Link AVP

   The Framed-AppleTalk-Link AVP (AVP Code 37) is of type Unsigned32 and
   contains the AppleTalk network number which should be used for the
   serial link to the user, which is another AppleTalk router. This AVP
   MUST only be present in an authorization response and is never used
   when the user is not another router.

   Despite the size of the field, values range from zero to 65535. The
   special value of zero indicates that this is an unnumbered serial
   link.  A value of one to 65535 means that the serial line between the
   NAS and the user should be assigned that value as an AppleTalk
   network number.


6.12.2.  Framed-AppleTalk-Network AVP

   The Framed-AppleTalk-Network AVP (AVP Code 38) is of type Unsigned32
   and contains the AppleTalk Network number which the NAS should probe
   to allocate an AppleTalk node for the user.  This AVP MUST only be
   present in an authorization response and is never used when the user
   is not another router. Multiple instances of this AVP indicate that
   the NAS may probe using any of the network numbers specified.

   Despite the size of the field, values range from zero to 65535. The
   special value zero indicates that the NAS should assign a network for
   the user, using its default cable range. A value between one and
   65535 (inclusive) indicates the AppleTalk Network the NAS should
   probe to find an address for the user.


6.12.3.  Framed-AppleTalk-Zone AVP

   The Framed-AppleTalk-Zone AVP (AVP Code 39) is of type OctetString
   and contains the AppleTalk Default Zone to be used for this user.
   This AVP MUST only be present in an authorization response. Multiple
   instances of this AVP in the same message are not allowed.

   The codification of the range of allowed usage of this field is
   outside the scope of this specification.


6.13.  ARAP Access

   The AVPs defined in this section are used when the user requests, or
   is being granted, access to ARAP. They are only present if the
   Framed-Protocol AVP (see Section 6.9.1) is set to AppleTalk Remote
   Access Protocol (ARAP).



Calhoun et al.             Expires August 2003                 [Page 31]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.13.1.  ARAP-Features AVP

   The ARAP-Features AVP (AVP Code 71) is of type OctetString, and MAY
   be present in the AA-Accept message if the Framed-Protocol AVP is set
   to the value of ARAP. See [RADIUSExt] for more information of the
   format of this AVP.


6.13.2.  ARAP-Zone-Access AVP

   The ARAP-Zone-Access AVP (AVP Code 72) is of type Enumerated, and MAY
   be present in the AA-Accept message if the Framed-Protocol AVP is set
   to the value of ARAP.

   The supported values are listed in [RADIUSTypes], and are defined in
   [RADIUSExt].


6.14.  Non-Framed Access Authorization AVPs

   This section contains the authorization AVPs that are needed to
   support terminal server functionality. AVPs defined in this section
   MAY be present in a message if the Service-Type AVP was set to
   "Login" or "Callback Login".


6.14.1.  Login-IP-Host AVP

   The Login-IP-Host AVP (AVP Code 14) [RADIUS] is of type OctetString
   and contains the IPv4 address of a host with which to connect the
   user when the Login-Service AVP is included.  It MAY be used in an
   AA-Request command as a hint to the Diameter Server that a specific
   host is desired, but the Diameter Server is not required to honor the
   hint in the AA-Answer.

   Two addresses have special significance: All ones and 0.  The value
   of all ones indicates that the NAS SHOULD allow the user to select an
   address.  The value 0 indicates that the NAS SHOULD select a host to
   connect the user to.


6.14.2.  Login-IPv6-Host AVP

   The Login-IPv6-Host AVP (AVP Code 98) [RADIUSIPv6] is of type
   OctetString and contains the IPv6 address of a host with which to
   connect the user when the Login-Service AVP is included.  It MAY be
   used in an AA-Request command as a hint to the Diameter Server that a
   specific host is desired, but the Diameter Server is not required to



Calhoun et al.             Expires August 2003                 [Page 32]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   honor the hint in the AA-Answer.

   Two addresses have special significance:
   0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF and 0. The value
   0xFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF indicates that the NAS SHOULD
   allow the user to select an address.  The value 0 indicates that the
   NAS SHOULD select a host to connect the user to.


6.14.3.  Login-Service AVP

   The Login-Service AVP (AVP Code 15) is of type Enumerated and
   contains the service which should be used to connect the user to the
   login host.  This AVP SHOULD only be present in authorization
   responses.

   The supported values are listed in [RADIUSTypes].  The following list
   is informational:

       0  Telnet
       1  Rlogin
       2  TCP Clear
       3  PortMaster (proprietary)
       4  LAT
       5  X25-PAD
       6  X25-T3POS
       8  TCP Clear Quiet (suppresses any NAS-generated connect
                   string)


6.15.  TCP Services

   The AVPs described in this section MAY be present if the Login-
   Service AVP is set to Telnet, Rlogin, TCP Clear or TCP Clear Quiet.


6.15.1.  Login-TCP-Port AVP

   The Login-TCP-Port AVP (AVP Code 16) is of type Unsigned32 and
   contains the TCP port with which the user is to be connected, when
   the Login-Service AVP is also present. This AVP SHOULD only be
   present in authorization responses. The value MUST NOT be greater
   than 65535.








Calhoun et al.             Expires August 2003                 [Page 33]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


6.15.2.  LAT Services

   The AVP described in this section MAY be present if the Login-Service
   AVP is set to LAT.


6.15.3.  Login-LAT-Service AVP

   The Login-LAT-Service AVP (AVP Code 34) is of type OctetString and
   contains the system with which the user is to be connected by LAT. It
   MAY be used in an authorization request as a hint to the server that
   a specific service is desired, but the server is not required to
   honor the hint in the corresponding response. This AVP MUST only be
   present in the response if the Login-Service AVP states that LAT is
   desired.

   Administrators use the service attribute when dealing with clustered
   systems, such as a VAX or Alpha cluster. In such an environment
   several different time sharing hosts share the same resources (disks,
   printers, etc.), and administrators often configure each to offer
   access (service) to each of the shared resources. In this case, each
   host in the cluster advertises its services through LAT broadcasts.

   Sophisticated users often know which service providers (machines) are
   faster and tend to use a node name when initiating a LAT connection.
   Alternately, some administrators want particular users to use certain
   machines as a primitive form of load balancing (although LAT knows
   how to do load balancing itself).

   The String field contains the identity of the LAT service to use.
   The LAT Architecture allows this string to contain $ (dollar), -
   (hyphen), . (period), _ (underscore), numerics, upper and lower case
   alphabetics, and the ISO Latin-1 character set extension [ISOLatin].
   All LAT string comparisons are case insensitive.


6.15.4.  Login-LAT-Node AVP

   The Login-LAT-Node AVP (AVP Code 35) is of type OctetString and
   contains the Node with which the user is to be automatically
   connected by LAT.  It MAY be used in an authorization request as a
   hint to the server that a specific LAT node is desired, but the
   server is not required to honor the hint in the corresponding
   response. This AVP MUST only be present in a response if the Service-
   Type AVP is set to LAT.

   The String field contains the identity of the LAT service to use.
   The LAT Architecture allows this string to contain $ (dollar), -



Calhoun et al.             Expires August 2003                 [Page 34]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   (hyphen), . (period), _ (underscore), numerics, upper and lower case
   alphabetics, and the ISO Latin-1 character set extension [ISOLatin].
   All LAT string comparisons are case insensitive.


6.15.5.  Login-LAT-Group AVP

   The Login-LAT-Group AVP (AVP Code 36) is of type OctetString and
   contains a string identifying the LAT group codes which this user is
   authorized to use. It MAY be used in an authorization request as a
   hint to the server that a specific group is desired, but the server
   is not required to honor the hint in the corresponding response. This
   AVP MUST only be present in a response if the Service-Type AVP is set
   to LAT.

   LAT supports 256 different group codes, which LAT uses as a form of
   access rights. LAT encodes the group codes as a 256 bit bitmap.

   Administrators can assign one or more of the group code bits at the
   LAT service provider; it will only accept LAT connections that have
   these group codes set in the bit map. The administrators assign a
   bitmap of authorized group codes to each user; LAT gets these from
   the operating system, and uses these in its requests to the service
   providers.

   The codification of the range of allowed usage of this field is
   outside the scope of this specification.


6.15.6.  Login-LAT-Port AVP

   The Login-LAT-Port AVP (AVP Code 63) is of type OctetString and
   contains the Port with which the user is to be connected by LAT. It
   MAY be used in an authorization request as a hint to the server that
   a specific port is desired, but the server is not required to honor
   the hint in the corresponding response. This AVP MUST only be present
   in a response if the Service-Type AVP is set to LAT.

   The String field contains the identity of the LAT service to use.
   The LAT Architecture allows this string to contain $ (dollar), -
   (hyphen), . (period), _ (underscore), numerics, upper and lower case
   alphabetics, and the ISO Latin-1 character set extension [ISOLatin].
   All LAT string comparisons are case insensitive.








Calhoun et al.             Expires August 2003                 [Page 35]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


7.  Tunneling Group AVPs

   The Tunneling AVP (AVP Code 401) is of type Grouped and contains the
   following AVPs used to describe a compulsory tunnel service
   [RADTunnels],[RADTunlAcct].  Its Data field has the following ABNF
   grammar:

      Tunneling     ::= < AVP Header: 401 >
                        { Tunnel-Type }
                        { Tunnel-Medium-Type }
                        { Tunnel-Client-Endpoint }
                        { Tunnel-Server-Endpoint }
                        [ Tunnel-Preference ]
                        [ Tunnel-Client-Auth-Id ]
                        [ Tunnel-Server-Auth-Id ]
                        [ Tunnel-Assignment-Id ]
                        [ Tunnel-Password ]
                        [ Tunnel-Private-Group-Id ]


                                         +---------------------+
                                         |    AVP Flag rules   |
                                         |----+-----+----+-----|----+
                AVP  Section             |    |     |SHLD| MUST|    |
Attribute Name  Code Defined  Value Type |MUST| MAY | NOT| NOT |Encr|
-----------------------------------------|----+-----+----+-----|----|
Tunneling        401   7.0    Grouped    | M  |  P  |    |  V  | N  |
Tunnel-Type       64   7.1    Enumerated | M  |  P  |    |  V  | Y  |
Tunnel-Medium-    65   7.2    Enumerated | M  |  P  |    |  V  | Y  |
  Type                                   |    |     |    |     |    |
Tunnel-Client-    66   7.3    UTF8String | M  |  P  |    |  V  | Y  |
  Endpoint                               |    |     |    |     |    |
Tunnel-Server-    67   7.4    UTF8String | M  |  P  |    |  V  | Y  |
  Endpoint                               |    |     |    |     |    |
Tunnel-Password   69   7.5    OctetString| M  |  P  |    |  V  | Y  |
Tunnel-Private-   81   7.6    UTF8String | M  |  P  |    |  V  | Y  |
  Group-Id                               |    |     |    |     |    |
Tunnel-           82   7.7    OctetString| M  |  P  |    |  V  | Y  |
  Assignment-Id                          |    |     |    |     |    |
Tunnel-Preference 83   7.8    Unsigned32 | M  |  P  |    |  V  | Y  |
Tunnel-Client-    90   7.9    Unsigned32 | M  |  P  |    |  V  | Y  |
  Auth-Id                                |    |     |    |     |    |
Tunnel-Server-    91   7.10   OctetString| M  |  P  |    |  V  | Y  |
  Auth-Id                                |    |     |    |     |    |
-----------------------------------------|----+-----+----+-----|----|






Calhoun et al.             Expires August 2003                 [Page 36]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


7.1.  Tunnel-Type AVP

   The Tunnel-Type AVP (AVP Code 64) is of type Enumerated and contains
   the tunneling protocol(s) to be used (in the case of a tunnel
   initiator) or the tunneling protocol in use (in the case of a tunnel
   terminator).  It MAY be used in an authorization request as a hint to
   the server that a specific tunnel type is desired, but the server is
   not required to honor the hint in the corresponding response.

   The Tunnel-Type AVP SHOULD also be included in Accounting-Request
   messages.

   A tunnel initiator is not required to implement any of these tunnel
   types; if a tunnel initiator receives a response that contains only
   unknown or unsupported Tunnel-Types, the tunnel initiator MUST behave
   as though a response was received with the Result-Code indicating a
   failure.

   The supported values are listed in [RADIUSTypes].  The following list
   is informational:

       1  Point-to-Point Tunneling Protocol (PPTP)
       2  Layer Two Forwarding (L2F)
       3  Layer Two Tunneling Protocol (L2TP)
       4  Ascend Tunnel Management Protocol (ATMP)
       5  Virtual Tunneling Protocol (VTP)
       6  IP Authentication Header in the Tunnel-mode (AH)
       7  IP-in-IP Encapsulation (IP-IP)
       8  Minimal IP-in-IP Encapsulation (MIN-IP-IP)
       9  IP Encapsulating Security Payload in the Tunnel-mode (ESP)
      10  Generic Route Encapsulation (GRE)
      11  Bay Dial Virtual Services (DVS)
      12  IP-in-IP Tunneling
      13  Virtual LANs (VLAN)


7.2.  Tunnel-Medium-Type AVP

   The Tunnel-Medium-Type AVP (AVP Code 65) is of type Enumerated and
   contains the transport medium to use when creating a tunnel for those
   protocols (such as L2TP) that can operate over multiple transports.
   It MAY be used in an authorization request as a hint to the server
   that a specific medium is desired, but the server is not required to
   honor the hint in the corresponding response.

   The supported values are listed in [RADIUSTypes].  The following list
   is informational:




Calhoun et al.             Expires August 2003                 [Page 37]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


       1  IPv4 (IP version 4)
       2  IPv6 (IP version 6)
       3  NSAP
       4  HDLC (8-bit multidrop)
       5  BBN 1822
       6  802 (includes all 802 media plus Ethernet "canonical
                    format")
       7  E.163 (POTS)
       8  E.164 (SMDS, Frame Relay, ATM)
       9  F.69 (Telex)
      10  X.121 (X.25, Frame Relay)
      11  IPX
      12  Appletalk
      13  Decnet IV
      14  Banyan Vines
      15  E.164 with NSAP format subaddress


7.3.  Tunnel-Client-Endpoint AVP

   The Tunnel-Client-Endpoint AVP (AVP Code 66) is of type UTF8String,
   and contains the address of the initiator end of the tunnel. It MAY
   be used in an authorization request as a hint to the server that a
   specific endpoint is desired, but the server is not required to honor
   the hint in the corresponding response.

   This AVP SHOULD be included in the corresponding Accounting-Request
   messages, in which case it indicates the address from which the
   tunnel was initiated. This AVP, along with the Tunnel-Server-Endpoint
   and Session-Id AVP [Base], MAY be used to provide a globally unique
   means to identify a tunnel for accounting and auditing purposes.

   If Tunnel-Medium-Type is IPv4 (1), then this string is either the
   fully qualified domain name (FQDN) of the tunnel client machine, or
   it is a "dotted-decimal" IP address.  Conformant implementations MUST
   support the dotted-decimal format and SHOULD support the FQDN format
   for IP addresses.

   If Tunnel-Medium-Type is IPv6 (2), then this string is either the
   FQDN of the tunnel client machine, or it is a text representation of
   the address in either the preferred or alternate form [IPv6Addr].
   Conformant implementations MUST support the preferred form and SHOULD
   support both the alternate text form and the FQDN format for IPv6
   addresses.

   If Tunnel-Medium-Type is neither IPv4 nor IPv6, this string is a tag
   referring to configuration data local to the Diameter client that
   describes the interface and medium-specific address to use.



Calhoun et al.             Expires August 2003                 [Page 38]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


7.4.  Tunnel-Server-Endpoint AVP

   The Tunnel-Server-Endpoint AVP (AVP Code 67) is of UTF8String, and
   contains the address of the server end of the tunnel. It MAY be used
   in an authorization request as a hint to the server that a specific
   endpoint is desired, but the server is not required to honor the hint
   in the corresponding response.

   This AVP SHOULD be included in the corresponding Accounting-Request
   messages, in which case it indicates the address from which the
   tunnel was initiated. This AVP, along with the Tunnel-Client-Endpoint
   and Session-Id AVP [Base], MAY be used to provide a globally unique
   means to identify a tunnel for accounting and auditing purposes.

   If Tunnel-Medium-Type is IPv4 (1), then this string is either the
   fully qualified domain name (FQDN) of the tunnel client machine, or
   it is a "dotted-decimal" IP address.  Conformant implementations MUST
   support the dotted-decimal format and SHOULD support the FQDN format
   for IP addresses.

   If Tunnel-Medium-Type is IPv6 (2), then this string is either the
   FQDN of the tunnel client machine, or it is a text representation of
   the address in either the preferred or alternate form [IPv6Addr].
   Conformant implementations MUST support the preferred form and SHOULD
   support both the alternate text form and the FQDN format for IPv6
   addresses.

   If Tunnel-Medium-Type is not IPv4 or IPv6, this string is a tag
   referring to configuration data local to the Diameter client that
   describes the interface and medium-specific address to use.


7.5.  Tunnel-Password AVP

   The Tunnel-Password AVP (AVP Code 69) is of type OctetString and may
   contain a password to be used to authenticate to a remote server.
   The Tunnel-Password AVP contains sensitive information. This value is
   not protected in the same manner as RADIUS [RADTunnels].

   As required in [Base], Diameter messages are encrypted using IPsec or
   TLS. The Tunnel-Password AVP SHOULD NOT be used in untrusted proxy
   environments without encrypting it using end-to-end security
   techniques, such as CMS Security [DiamCMS].








Calhoun et al.             Expires August 2003                 [Page 39]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


7.6.  Tunnel-Private-Group-Id AVP

   The Tunnel-Private-Group-Id AVP (AVP Code 81) is of type UTF8String,
   and contains the group Id for a particular tunneled session. The
   Tunnel-Private-Group-Id AVP MAY be included in an authorization
   request if the tunnel initiator can pre-determine the group resulting
   from a particular connection and SHOULD be included in the
   authorization response if this tunnel session is to be treated as
   belonging to a particular private group. Private groups may be used
   to associate a tunneled session with a particular group of users.
   For example, it MAY be used to facilitate routing of unregistered IP
   addresses through a particular interface.  This AVP SHOULD be
   included in the Accounting-Request messages which pertain to the
   tunneled session.


7.7.  Tunnel-Assignment-Id AVP

   The Tunnel-Assignment-Id AVP (AVP Code 82) is of type OctetString and
   is used to indicate to the tunnel initiator the particular tunnel to
   which a session is to be assigned.  Some tunneling protocols, such as
   [PPTP] and [L2TP], allow for sessions between the same two tunnel
   endpoints to be multiplexed over the same tunnel and also for a given
   session to utilize its own dedicated tunnel. This attribute provides
   a mechanism for Diameter to be used to inform the tunnel initiator
   (e.g.  PAC, LAC) whether to assign the session to a multiplexed
   tunnel or to a separate tunnel. Furthermore, it allows for sessions
   sharing multiplexed tunnels to be assigned to different multiplexed
   tunnels.

   A particular tunneling implementation may assign differing
   characteristics to particular tunnels.  For example, different
   tunnels may be assigned different QOS parameters.  Such tunnels may
   be used to carry either individual or multiple sessions.  The Tunnel-
   Assignment-Id attribute thus allows the Diameter server to indicate
   that a particular session is to be assigned to a tunnel that provides
   an appropriate level of service.  It is expected that any QOS-related
   Diameter tunneling attributes defined in the future that accompany
   this attribute will be associated by the tunnel initiator with the Id
   given by this attribute.  In the meantime, any semantic given to a
   particular Id string is a matter left to local configuration in the
   tunnel initiator.

   The Tunnel-Assignment-Id AVP is of significance only to Diameter and
   the tunnel initiator.  The Id it specifies is intended to be of only
   local use to Diameter and the tunnel initiator. The Id assigned by
   the tunnel initiator is not conveyed to the tunnel peer.




Calhoun et al.             Expires August 2003                 [Page 40]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   This attribute MAY be included in authorization responses. The tunnel
   initiator receiving this attribute MAY choose to ignore it and assign
   the session to an arbitrary multiplexed or non-multiplexed tunnel
   between the desired endpoints.  This AVP SHOULD also be included in
   the Accounting-Request messages which pertain to the tunneled
   session.

   If a tunnel initiator supports the Tunnel-Assignment-Id AVP, then it
   should assign a session to a tunnel in the following manner:

      - If this AVP is present and a tunnel exists between the specified
        endpoints with the specified Id, then the session should be
        assigned to that tunnel.

      - If this AVP is present and no tunnel exists between the
        specified endpoints with the specified Id, then a new tunnel
        should be established for the session and the specified Id
        should be associated with the new tunnel.

      - If this AVP is not present, then the session is assigned to an
        unnamed tunnel.  If an unnamed tunnel does not yet exist between
        the specified endpoints then it is established and used for this
        and subsequent sessions established without the Tunnel-
        Assignment-Id attribute.  A tunnel initiator MUST NOT assign a
        session for which a Tunnel-Assignment-Id AVP was not specified
        to a named tunnel (i.e. one that was initiated by a session
        specifying this AVP).

   Note that the same Id may be used to name different tunnels if such
   tunnels are between different endpoints.

7.8.  Tunnel-Preference AVP

   The Tunnel-Preference AVP (AVP Code 83) is of type Unsigned32 and is
   used to identify the relative preference assigned to each tunnel when
   more than one set of tunneling AVPs is returned within separate
   Grouped-AVP AVPs. It MAY be used in an authorization request as a
   hint to the server that a specific preference is desired, but the
   server is not required to honor the hint in the corresponding
   response.

   For example, suppose that AVPs describing two tunnels are returned by
   the server, one with a Tunnel-Type of PPTP and the other with a
   Tunnel-Type of L2TP.  If the tunnel initiator supports only one of
   the Tunnel-Types returned, it will initiate a tunnel of that type.
   If, however, it supports both tunnel protocols, it SHOULD use the
   value of the Tunnel-Preference AVP to decide which tunnel should be
   started.  The tunnel having the numerically lowest value in the Value



Calhoun et al.             Expires August 2003                 [Page 41]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   field of this AVP SHOULD be given the highest preference.  The values
   assigned to two or more instances of the Tunnel-Preference AVP within
   a given authorization response MAY be identical.  In this case, the
   tunnel initiator SHOULD use locally configured metrics to decide
   which set of AVPs to use.


7.9.  Tunnel-Client-Auth-Id AVP

   The Tunnel-Client-Auth-Id AVP (AVP Code 90) is of type Unsigned32 and
   specifies the name used by the tunnel initiator during the
   authentication phase of tunnel establishment.  It MAY be used in an
   authorization request as a hint to the server that a specific
   preference is desired, but the server is not required to honor the
   hint in the corresponding response. This AVP MUST be present in the
   authorization response if an authentication name other than the
   default is desired. This AVP SHOULD be included in the Accounting-
   Request messages which pertain to the tunneled session.


7.10.  Tunnel-Server-Auth-Id AVP

   The Tunnel-Server-Auth-Id AVP (AVP Code 91) is of type OctetString
   and specifies the name used by the tunnel terminator during the
   authentication phase of tunnel establishment. It MAY be used in an
   authorization request as a hint to the server that a specific
   preference is desired, but the server is not required to honor the
   hint in the corresponding response. This AVP MUST be present in the
   authorization response if an authentication name other than the
   default is desired. This AVP SHOULD be included in the the
   Accounting-Request messages which pertain to the tunneled session.



8.  NAS Accounting

   Applications implementing this specification use Diameter Accounting
   as defined in the Base [Base] with the addition of the AVPs in the
   following section.

   Accounting Request messages (ACR) SHOULD be sent after any
   Authentication or Authorization transaction and at the end of a
   Session.  The Accounting-Record-Type value indicates the type of
   event.  All other AVPs identify the session and provide additional
   information relevant to the event.

   If Authentication and Authorization are contained in one message
   (typical case), then one START_RECORD should be sent.  If



Calhoun et al.             Expires August 2003                 [Page 42]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   Authentication and Authorization occur in seperate transactions, the
   first message should generate a START_RECORD, and the later, an
   INTERIM_RECORD.  For a given session, there should only be one set of
   matching START and STOP records, with any number of INTERIM_RECORDS
   in between, or one EVENT_RECORD.

   The following table describes the AVPs, their AVP Code values, types,
   possible flag values and whether the AVP MAY be encrypted.

                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|    |
   Attribute Name  Code Defined  Value Type |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Accounting-      363  8.1     Unsigned64 | M  |  P  |    |  V  | Y  |
     Input-Octets                           |    |     |    |     |    |
   Accounting-      364  8.2     Unsigned64 | M  |  P  |    |  V  | Y  |
     Output-Octets                          |    |     |    |     |    |
   Accounting-      365  8.3     Unsigned64 | M  |  P  |    |  V  | Y  |
     Input-Packets                          |    |     |    |     |    |
   Accounting-      366  8.4     Unsigned64 | M  |  P  |    |  V  | Y  |
     Output-Packets                         |    |     |    |     |    |
   Acct-Session-Time 46  8.5     Unsigned32 | M  |  P  |    |  V  | Y  |
   Acct-Authentic    45  8.6     Enumerated | M  |  P  |    |  V  | Y  |
   Acct-Delay-Time   41  8.7     Unsigned32 | M  |  P  |    |  V  | Y  |
   Acct-Link-Count   51  8.8     Unsigned32 | M  |  P  |    |  V  | Y  |
   Acct-Tunnel-      68  8.9     OctetString| M  |  P  |    |  V  | Y  |
     Connection                             |    |     |    |     |    |
   Acct-Tunnel-      86  8.10    Unsigned32 | M  |  P  |    |  V  | Y  |
     Packets-Lost                           |    |     |    |     |    |
   -----------------------------------------|----+-----+----+-----|----|


8.1.  Accounting-Input-Octets AVP

   The Accounting-Input-Octets AVP (AVP Code 363) is of type Unsigned64,
   and contains the number of octets received from the user.

   For NAS usage, this AVP indicates how many octets have been received
   from the port in the course of this session and can only be present
   in ACR messages with an Accounting-Record-Type of INTERIM_RECORD or
   STOP_RECORD.








Calhoun et al.             Expires August 2003                 [Page 43]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


8.2.  Accounting-Output-Octets AVP

   The Accounting-Output-Octets AVP (AVP Code 364) is of type
   Unsigned64, and contains the number of octets sent to the user.

   For NAS usage, this AVP indicates how many octets have been sent to
   the port in the course of this session and can only be present in ACR
   messages with an Accounting-Record-Type of INTERIM_RECORD or
   STOP_RECORD.



8.3.  Accounting-Input-Packets AVP

   The Accounting-Input-Packets (AVP Code 365) is of type Unsigned64,
   and contains the number of packets received from the user.

   For NAS usage, this AVP indicates how many packets have been received
   from the port over the course of a session being provided to a Framed
   User and can only be present in ACR messages with an Accounting-
   Record-Type of INTERIM_RECORD or STOP_RECORD.


8.4.  Accounting-Output-Packets AVP

   The Accounting-Output-Packets (AVP Code 366) is of type Unsigned64,
   and contains the number of IP packets sent to the user.

   For NAS usage, this AVP indicates how many packets have been sent to
   the port over the course of a session being provided to a Framed User
   and can only be present in ACR messages with an Accounting-Record-
   Type of INTERIM_RECORD or STOP_RECORD.


8.5.  Acct-Session-Time AVP

   The Acct-Session-Time AVP (AVP Code 46) is of type Unsigned32, and
   indicates the length of the current session in seconds.  It can only
   be present in ACR messages with an Accounting-Record-Type of
   INTERIM_RECORD or STOP_RECORD.

8.6.  Acct-Authentic AVP

   The Acct-Authentic AVP (AVP Code 45) is of type Enumerated, and
   specifies how the user was authenticated. The supported values are
   listed in [RADIUSTypes]. The following list is informational:

        1  RADIUS



Calhoun et al.             Expires August 2003                 [Page 44]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


        2  Local
        3  Remote
        4  Diameter


8.7.  Acct-Delay-Time

   The Acct-Delay-Time AVP (AVP Code 41) is of type Unsigned32 and
   indicates the number of seconds during which the Diameter client has
   been trying to send the Accounting-Request (ACR) which contains it.
   The accounting server may subtract this value from the time the ACR
   arrives at the server to calculate the approximate time of the event
   that caused the ACR to be generated.

   This AVP is not used for retransmissions at the transport level (TCP
   or SCTP).  Rather, it may be used when an ACR command cannot be
   transmitted because there is no appropriate peer to transmit it to or
   was rejected because it could not be delivered to its destination.
   In these cases, the command MAY be buffered and transmitted some time
   later when an appropriate peer-connection is available or after
   sufficient time has passed that the destination-host may be reachable
   and operational.  If the ACR is resent in this way the Acct-Delay-
   Time AVP SHOULD be included.  The value of this AVP indicates the
   number of seconds that elapsed between the time of the first attempt
   at transmission and the current attempt at transmission.


8.8.  Acct-Link-Count

   The Acct-Link-Count AVP (AVP Code 51) is of type Unsigned32 and
   indicates the total number of links that have been active (current or
   closed) in a given multilink session, at the time the accounting
   record is generated.  This AVP MAY be included in Accounting-Requests
   for any session which may be part of a multilink service.

   The Acct-Link-Count AVP may be used to make it easier for an
   accounting server to know when it has all the records for a given
   multilink service.  When the number of Accounting-Requests received
   with Accounting-Record-Type = STOP_RECORD and the same Acct-Multi-
   Session-Id and unique Session-Id's equals the largest value of Acct-
   Link-Count seen in those Accounting-Requests, all STOP_RECORD
   Accounting-Requests for that multilink service have been received.

   The following example showing eight Accounting-Requests illustrates
   how the Acct-Link-Count AVP is used.  In the table below, only the
   relevant AVPs are shown although additional AVPs containing
   accounting information will also be present in the Accounting-
   Requests.



Calhoun et al.             Expires August 2003                 [Page 45]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      Acct-Multi-                   Accounting-     Acct-
      Session-Id     Session-Id     Record-Type     Link-Count
      --------------------------------------------------------
        "...10"        "...10"      START_RECORD        1
        "...10"        "...11"      START_RECORD        2
        "...10"        "...11"      STOP_RECORD         2
        "...10"        "...12"      START_RECORD        3
        "...10"        "...13"      START_RECORD        4
        "...10"        "...12"      STOP_RECORD         4
        "...10"        "...13"      STOP_RECORD         4
        "...10"        "...10"      STOP_RECORD         4


8.9.  Acct-Tunnel-Connection AVP

   The Acct-Tunnel-Connection AVP (AVP Code 68) is of type OctetString,
   and contains the identifier assigned to the tunnel session. This AVP,
   along with the Tunnel-Client-Endpoint and Tunnel-Server-Endpoint
   AVPs, may be used to provide a means to uniquely identify a tunnel
   session for auditing purposes.

   The format of the identifier in this AVP depends upon the value of
   the Tunnel-Type AVP. For example, to fully identify an L2TP tunnel
   connection, the L2TP Tunnel Id and Call Id might be encoded in this
   field. The exact encoding of this field is implementation dependent.


8.10.  Acct-Tunnel-Packets-Lost AVP

   The Acct-Tunnel-Packets-Lost AVP (AVP Code 86) is of type Unsigned32
   and contains the number of packets lost on a given link.




9.  RADIUS/Diameter Protocol Interactions


   This section describes some basic guidelines that may be used by
   servers that act as AAA Translation Agents. A complete description of
   all the differences between RADIUS and Diameter is beyond the scope
   of this section and document.  Note that this document does not
   restrict implementations from creating additional methods, as long as
   the translation function doesn't violate the RADIUS or the Diameter
   protocols.






Calhoun et al.             Expires August 2003                 [Page 46]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|    |
   Attribute Name  Code Defined  Value Type |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   NAS-Identifier    32  9.2.1   UTF8String | M  |  P  |    |  V  | Y  |
   NAS-IP-Address     4  9.2.2   OctetString| M  |  P  |    |  V  | Y  |
   NAS-IPv6-Address  95  9.2.3   OctetString| M  |  P  |    |  V  | Y  |
   State             24  9.2.4   OctetString| M  |  P  |    |  V  | Y  |
   Termination-     295  9.2.5   Enumerated | M  |  P  |    |  V  | Y  |
      Cause                                 |    |     |    |     |    |
   -----------------------------------------|----+-----+----+-----|----|

   There are primarily two different situations that must be handled;
   one where a RADIUS request is received that must be forwarded as a
   Diameter request, and the inverse.  RADIUS does not support a peer-
   to-peer architecture and server initiated operations are generally
   not supported.  See [RADDynAuth] for an alternative.

   Some RADIUS attributes are encrypted.  RADIUS security and encryption
   techniques are applied on a hop-per-hop basis. A Diameter agent will
   have to decrypt RADIUS attribute data entering the Diameter system
   and if that information is forwarded, MUST secure it using Diameter
   specific techniques.

   Note that this section uses the two terms; AVP and attribute in a
   consise manner. The former is used to signify a Diameter AVP, while
   the latter is used to signify a RADIUS attribute.


9.1.  RADIUS Request Forwarded as Diameter Request

   This section describes the actions that should be followed when a
   Translation Agent receives a RADIUS message that is to be translated
   to a Diameter message.

   It is important to note that RADIUS servers are assumed to be
   stateless, and this section maintains that assumption. It is also
   quite possible for the RADIUS messages that comprise the session
   (i.e. authentication and accounting messages) will be handled by
   different Translation Agents in the proxy network. Therefore, a
   RADIUS/Diameter Translation Agent SHOULD NOT assume to track session
   state information.

   When a Translation Agent receives a RADIUS message, the following
   steps should be taken:




Calhoun et al.             Expires August 2003                 [Page 47]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      - If a Message-Authenticator attribute is present, it MUST be
        checked and discarded.  The gateway system SHOULD generate and
        include a Message-Authenticator in return responses to this
        system.
      - The transport address of the sender MUST be checked against the
        NAS identifying attributes. See the description of NAS-
        Identifier and NAS-IP-Address below.
      - The Diameter Origin-Host and Origin-Realm AVPs MUST be created
        and added using the information from the NAS-Identifier
        attribute, and/or the FQDN corresponding to the NAS-IP-Address
        attribute.  The AAA protocol specified in the identity would be
        set to "RADIUS".
      - The Proxy-Info group SHOULD be added with the local server's
        identity being specified in the Proxy-Host AVP.  This should
        ensure that the response is returned to this system.
      - The Destination-Realm AVP is created from the information found
        in the RADIUS User-Name attribute.
      - The Translation Agent must maintain transaction state
        information relevant to the RADIUS request, such as the
        Identifier field in the RADIUS header, any existing RADIUS
        Proxy-State attribute as well as the source IP address and port
        number of the UDP packet. These may be maintained locally in a
        state table, or may be saved in a Proxy-Info AVP group.
      - If the RADIUS request contained a State attribute, and the
        prefix of the data is "Diameter/", the data following the prefix
        contains the Diameter Session-Id. If no such attributes are
        present, and the RADIUS command is an Access-Request, a new
        Session-Id is created. The Session-Id is included in the
        Session-Id AVP.
      - If the RADIUS User-Password attribute is present, the password
        must be unencrypted using the link's RADIUS shared secret. And
        forwarded using Diameter security.
      - If the RADIUS CHAP-Password attribute is present, the Ident and
        Data portion of the attribute are used to create the CHAP-Auth
        grouped AVP.
      - If the RADIUS message contains an address attribute, (e.g.
        Framed-IP-Address, Login-IP-Host, Login-IPv6-Host, NAS-IP-
        Address, NAS-IPv6-Address) it MUST be converted to the
        appropriate Diameter AVP and Address type.
      - If the RADIUS message contains Tunnel information [RADTunnels],
        the attributes or tagged groups should each be converted to a
        Diameter Tunneling Grouped AVP set. If the tunnel information
        contains a Tunnel-Password attribute, the RADIUS encryption must
        be resolved, and the password forwarded using Diameter security
        methods.
      - If the RADIUS message received is an Accounting-Request, the
        Acct-Status-Type attribute value must be converted to a
        Accounting-Record-Type AVP value.  If the Acct-Status-Type



Calhoun et al.             Expires August 2003                 [Page 48]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


        attribute value is STOP, the local server MUST issue a Session-
        Termination-Request message once the Diameter Accounting-Answer
        message has been received.
      - If the Accounting message contains a Acct-Termination-Cause
        attribute, it should be translated to the equivalent
        Termination-Cause AVP value.  (see below)
      - If the RADIUS message contains the Accounting-Input-Octets,
        Accounting-Input-Packets, Accounting-Output-Octets or
        Accounting-Output-Packets, these attributes must be converted to
        the Diameter equivalent ones. Further, if the Acct-Input-
        Gigawords or Acct-Output-Gigawords attributes are present, these
        must be used to properly compute the Diameter accounting AVPs.

   The corresponding Diameter response is always guaranteed to be
   received by the same Translation Agent that translated the original
   request, due to the contents of the Origin-Host AVP in the Diameter
   request. The following steps are applied to the response message
   during the Diameter to RADIUS translation:

      - If the Diameter Command-Code is set to AA-Answer and the Result-
        Code AVP is set to DIAMETER_MULTI_ROUND_AUTH, the gateway must
        send a RADIUS Access-Challenge with the Diameter Session-Id and
        the Origin-Host AVPs encapsulated in the RADIUS State attribute,
        with the prefix "Diameter/". This is necessary in order to
        ensure that the Translation Agent that will receive the
        subsequent RADIUS Access-Request will have access to the Session
        Identifier, and be able to set the Destination-Host to the
        correct value. If the Multi-Round-Time-Out AVP is present, the
        value of the AVP MUST be inserted in the RADIUS Session-Timeout
        AVP.
      - If the Command-Code is set to AA-Answer, the Diameter Session-Id
        AVP is saved in a new RADIUS Class attribute, whose format
        consists of the string "Diameter/" followed by the Diameter
        Session Identifier. This will ensure that the subsequent
        Accounting messages, which could be received by any Translation
        Agent, would have access to the original Diameter Session
        Identifier.
      - If a Proxy-State attribute was present in the RADIUS request,
        the same attribute is added in the response. This information
        may be found in the Proxy-Info AVP group, or in a local state
        table.
      - If state information regarding the RADIUS request was saved in a
        Proxy-Info AVP or local state table, the RADIUS Identifier and
        UDP IP Address and port number are extracted and used in issuing
        the RADIUS reply.






Calhoun et al.             Expires August 2003                 [Page 49]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


9.1.1.  Diameter Request Forwarded as RADIUS Request

   When a server receives a Diameter request that is to be forwarded to
   a RADIUS entity, the following steps are an example of the steps that
   may be followed:

      - The Origin-Host AVP's value is inserted in the NAS-Identifier
        attribute.
      - The following information MUST be present in the corresponding
        Diameter response, and therefore MUST be saved either in a local
        state table, or it MAY be encoded in a RADIUS Proxy-State
        attribute:
           1. Origin-Host AVP
           2. Session-Id AVP
           3. Proxy-Info AVP
           4. Route-Record AVPs (in the proper order)
           5. Any other AVP that MUST be present in the response, and
              has no corresponding RADIUS attribute.
      - If the CHAP-Auth AVP is present, the grouped AVPs are used to
        create the RADIUS CHAP-Password attribute data.
      - If the User-Password AVP is present, the data should be
        encrypted using RADIUS rules.  Likewise for any other encrypted
        attribute values.
      - AVPs that are of the type Address, must be translated to the
        corresponding RADIUS attribute.
      - If the Accounting-Input-Octets, Accounting-Input-Packets,
        Accounting-Output-Octets or Accounting-Output-Packets AVPs are
        present, these must be translated to the corresponding RADIUS
        attributes.  Further, the value of the Diameter AVPs do not fit
        within a 32-bit RADIUS attribute, the RADIUS Acct-Input-
        Gigawords and Acct-Output-Gigawords must be used.
      - If the RADIUS link supports the Message-Authenticator attribute
        [RADIUSExt] it SHOULD be generated and added to the request.


   When the corresponding response is received by the Translation Agent,
   which is guaranteed in the RADIUS protocol, the following steps may
   be followed:

      - If the RADIUS code is set to Access-Challenge, a Diameter AA-
        Answer message is created with the Result-Code set to
        DIAMETER_MULTI_ROUND_AUTH. If the Session-Timeout AVP is present
        in the RADIUS message, its value is inserted in the Multi-Round-
        Time-Out AVP.
      - If a Proxy-State attribute is present, extract the encoded
        information, otherwise retrieve the original Proxy-Info AVP
        group information from the local state table.
      - The request's Origin-Host information is added to the



Calhoun et al.             Expires August 2003                 [Page 50]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


        Destination-Host AVP.
      - The Acct-Session-Id information is added to the Session-Id AVP.
      - The Route-Record AVPs MUST be added to the Diameter message, in
        the same order they were present in the request.
      - If a Proxy-Info AVP was present in the request, the same AVP
        MUST be added to the response.
      - If the RADIUS State attributes are present, these attributes
        must be present in the Diameter response.
      - Any other AVPs that were saved, and MUST be present in the
        response, are added to the message.



9.2.  AVPs Used Only for Compatibility

   The AVPs defined in this section SHOULD only used for backwards
   compatibility when a Diameter/RADIUS translation function is invoked,
   and are not typically originated by Diameter systems during normal
   operations.


9.2.1.  NAS-Identifier AVP

   The NAS-Identifier AVP (AVP Code 32) [RADIUS] is of type UTF8String
   and contains the identity of the NAS providing service to the user.
   This AVP SHOULD only be added by a RADIUS/Diameter Translation Agent.
   When this AVP is present, the Origin-Host AVP identifies the
   RADIUS/Diameter Translation Agent rather than the NAS providing
   service to the user.

   In RADIUS it would be possible for a rogue NAS to forge the NAS-
   Identifier attribute. Diameter/RADIUS translation agents SHOULD
   attempt to check a received NAS-Identifier attribute against the
   source address of the RADIUS packet, by doing an A/AAAA RR query. If
   the NAS-Identifier attribute contains an FQDN, then such a query
   would resolve to an IP address matching the source address. However,
   the NAS-Identifier attribute is not required to contain an FQDN, so
   such a query could fail. In this case, an error should be logged, but
   no other action taken, other than doing a reverse lookup on the
   source address and inserting the resulting FQDN into the Route-Record
   AVP.

   Diameter agents and servers SHOULD check whether a NAS-Identifier AVP
   corresponds to an entry in the Record-Route AVP.  If no match is
   found, then an error is logged, but no other action is taken.






Calhoun et al.             Expires August 2003                 [Page 51]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


9.2.2.  NAS-IP-Address AVP

   The NAS-IP-Address AVP (AVP Code 4) [RADIUS] is of type OctetString,
   and contains the IP Address of the NAS providing service to the user.
   This AVP SHOULD only be added by a RADIUS/Diameter Translation Agent.
   When this AVP is present, the Origin-Host AVP identifies the
   RADIUS/Diameter Translation Agent rather than the NAS providing
   service to the user.

   In RADIUS it would be possible for a rogue NAS to forge the NAS-IP-
   Address attribute value. Diameter/RADIUS translation agents MUST
   check a received NAS-IP-Address or NAS-IPv6-Address attribute against
   the source address of the RADIUS packet. If they do not match, and
   the Diameter/RADIUS translation agent does not know whether the
   packet was sent by a RADIUS proxy or NAS (e.g. no Proxy-State
   attribute) then by default it is assumed that the source address
   corresponds to a RADIUS proxy, and that the NAS Address is behind
   that proxy, potentially with some additional RADIUS proxies in
   between.  The Diameter/RADIUS translation agent MUST insert entries
   in the Route-Record AVP corresponding to the apparent route.  This
   implies doing a reverse lookup on the source address and NAS-IP-
   Address, or NAS-IPv6-Address attributes in order to determine the
   corresponding FQDNs.

   If the source address and the NAS-IP-Address, or NAS-IPv6-Address do
   not match, and the Diameter/RADIUS translation agent knows that it is
   talking directly to the NAS (e.g. no RADIUS proxies between it and
   the NAS), then the error should be logged, and the packet MUST be
   discarded.

   Diameter agents and servers MUST check whether the NAS-IP-Address AVP
   corresponds to an entry in the Record-Route AVP.  This is done by
   doing a reverse lookup (PTR RR) for the NAS-IP-Address to retrieve
   the corresponding FQDN, and checking for a match with the Record-
   Route AVP. If no match is found, then an error is logged, but no
   other action is taken.


9.2.3.  NAS-IPv6-Address AVP

   The NAS-IPv6-Address AVP (AVP Code 95) [RADIUSIPv6] is of type
   OctetString, and contains the IPv6 Address of the NAS providing
   service to the user.  This AVP SHOULD only be added by a
   RADIUS/Diameter Translation Agent.  When this AVP is present, the
   Origin-Host AVP identifies the RADIUS/Diameter Translation Agent
   rather than the NAS providing service to the user.

   In RADIUS it would be possible for a rogue NAS to forge the NAS-



Calhoun et al.             Expires August 2003                 [Page 52]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   IPv6-Address attribute. Diameter/RADIUS translation agents MUST check
   a received NAS-IPv6-Address attribute against the source address of
   the RADIUS packet. If they do not match, and the Diameter/RADIUS
   translation agent does not know whether the packet was sent by a
   RADIUS proxy or NAS (e.g. no Proxy-State attribute) then by default
   it is assumed that the source address corresponds to a RADIUS proxy,
   and that the NAS-IPv6-Address is behind that proxy, potentially with
   some additional RADIUS proxies in between.  The Diameter/RADIUS
   translation agent MUST insert entries in the Route-Record AVP
   corresponding to the apparent route.  This implies doing a reverse
   lookup on the source address and NAS-IP-Address attributes in order
   to determine the corresponding FQDNs.

   If the source address and the NAS-IPv6-Address do not match, and the
   Diameter/RADIUS translation agent knows that it is talking directly
   to the NAS (e.g. no RADIUS proxies between it and the NAS), then the
   error should be logged, and the packet MUST be discarded.

   Diameter agents and servers MUST check whether the NAS-IPv6-Address
   AVP corresponds to an entry in the Record-Route AVP.  This is done by
   doing a reverse lookup (PTR RR) for the NAS-IPv6-Address to retrieve
   the corresponding FQDN, and checking for a match with the Record-
   Route AVP. If no match is found, then an error is logged, but no


9.2.4.  State AVP

   The State AVP (AVP Code 24) [RADIUS] is of type OctetString and has
   two uses in the Diameter NAS application.

   The State AVP MAY be sent by a Diameter Server to a NAS in an AA-
   Response command that contains a Result-Code of
   DIAMETER_MULTI_ROUND_AUTH.  If so, the NAS MUST return it unmodified
   in the subsquent AA-Request command.

   The State AVP MAY also be sent by a Diameter Server to a NAS in an
   AA-Response command that also includes a Termination-Action AVP with
   the value of AA-REQUEST.  If the NAS performs the Termination-Action
   by sending a new AA-Request command upon termination of the current
   service, it MUST return the State AVP unmodified in the new request
   command.

   In either usage the NAS MUST NOT interpret the AVP locally.  Usage of
   the State AVP is implementation dependent.







Calhoun et al.             Expires August 2003                 [Page 53]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


9.2.5.  Termination-Cause AVP Code Values

   This section defines a mapping between Termination-Cause AVP code
   values and RADIUS Acct-Terminate-Cause attribute code values from RFC
   2866 [RADIUSAcct] and [RADIUSTypes], thereby allowing a
   RADIUS/Diameter Translation Agent to convert between the attribute
   and AVP values.  This section thus extends the definitions in the
   "Termination-Cause AVP" section of the Base Diameter specification.

   The table in this section defines the mapping between Termination-
   Cause AVP and RADIUS Acct-Terminate-Cause causes.
                                 +-----------------------+
                                 |         Value         |
                                 +-----------+-----------+
   Cause Value Name              |  RADIUS   | Diameter  |
   ------------------------------|-----------+-----------+
   User Request                  |     1     |   11      |
   Lost Carrier                  |     2     |   12      |
   Lost Service                  |     3     |   13      |
   Idle Timeout                  |     4     |   14      |
   Session Timeout               |     5     |   15      |
   Admin Reset                   |     6     |   16      |
   Admin Reboot                  |     7     |   17      |
   Port Error                    |     8     |   18      |
   NAS Error                     |     9     |   19      |
   NAS Request                   |     10    |   20      |
   NAS Reboot                    |     11    |   21      |
   Port Unneeded                 |     12    |   22      |
   Port Preempted                |     13    |   23      |
   Port Suspended                |     14    |   24      |
   Service Unavailable           |     15    |   25      |
   Callback                      |     16    |   26      |
   User Error                    |     17    |   27      |
   Host Request                  |     18    |   28      |
   Supplicant Restart            |     19    |   29      |  [RAD802.1X]
   Reauthentication Failure      |     20    |   30      |  [RAD802.1X]
   Port Reinit                   |     21    |   31      |  [RAD802.1X]
   Port Disabled                 |     22    |   32      |  [RAD802.1X]
   ------------------------------|-----------+-----------+

   From RFC 2866, the termination causes are as follows:

   User Request         User requested termination of service, for
                        example with LCP Terminate or by logging out.

   Lost Carrier         DCD was dropped on the port.

   Lost Service         Service can no longer be provided; for



Calhoun et al.             Expires August 2003                 [Page 54]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                        example, user's connection to a host was
                        interrupted.

   Idle Timeout         Idle timer expired.

   Session Timeout      Maximum session length timer expired.

   Admin Reset          Administrator reset the port or session.


   Admin Reboot         Administrator is ending service on the NAS,
                        for example prior to rebooting the NAS.

   Port Error           NAS detected an error on the port which
                        required ending the session.

   NAS Error            NAS detected some error (other than on the
                        port) which required ending the session.

   NAS Request          NAS ended session for a non-error reason not
                        otherwise listed here.

   NAS Reboot           The NAS ended the session in order to reboot
                        non-administratively ("crash").

   Port Unneeded        NAS ended session because resource usage fell
                        below low-water mark (for example, if a
                        bandwidth-on-demand algorithm decided that
                        the port was no longer needed).

   Port Preempted       NAS ended session in order to allocate the
                        port to a higher priority use.

   Port Suspended       NAS ended session to suspend a virtual
                        session.

   Service Unavailable  NAS was unable to provide requested service.

   Callback             NAS is terminating current session in order
                        to perform callback for a new session.

   User Error           Input from user is in error, causing
                        termination of session.

   Host Request         Login Host terminated session normally.






Calhoun et al.             Expires August 2003                 [Page 55]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


9.3.  Prohibited RADIUS Attributes

   The following RADIUS attributes MUST NOT be transfered to a Diameter
   message.  Many of these are discussed in section 9.1.

   Attribute Description       Defined     Nearest Diameter AVP
   -----------------------------------------------------------------
    3 CHAP-Password            RFC 2865    CHAP-Auth Group
   26 Vendor-Specific          RFC 2865    Vendor Specific AVP
   40 Acct-Status-Type         RFC 2866    Accounting-Record-Type
   42 Acct-Input-Octets        RFC 2866    Accounting-Input-Octets
   43 Acct-Output-Octets       RFC 2866    Accounting-Output-Octets
   47 Acct-Input-Packets       RFC 2866    Accounting-Input-Packets
   48 Acct-Output-Packets      RFC 2866    Accounting-Output-Packets
   49 Acct-Terminate-Cause     RFC 2866    Termination-Cause
   52 Acct-Input-Gigawords     RFC 2869    Accounting-Input-Octets
   53 Acct-Output-Gigawords    RFC 2869    Accounting-Output-Octets
   80 Message-Authenticator    RFC 2869    none - check and discard


9.4.  Translatable Diameter AVPs

   In general, Diameter AVPs that are not RADIUS compatible have code
   values greater than 255.  The table in the section above shows the
   AVPs that can be converted into RADIUS attributes.

   Another problem may occur with Diameter AVP values that may be more
   than 253 octets in length (eg: Reply-Message).  Some RADIUS
   attributes allow concatenation of multiple instances to overcome this
   limitation.  If this is not possible, an attribute error should be
   returned.


9.5.  RADIUS Vendor Specific Attributes

   RADIUS supports the inclusion of Vendor Specific Attributes (VSAs)
   through the use of attribute 26.  The recommended format [RADIUS] of
   the attribute data field includes a 4 octet vendor code followed by a
   one octet vendor type field and a one octet length field.  The last
   two fields MAY be repeated.


9.5.1.  Forwarding a Diameter Vendor AVP as a RADIUS VSA

   The RADIUS VSA attribute should consist of the following fields;

      RADIUS Type = 26, Vendor Specific Attribute
      RADIUS Length = total length of attribute (header + data)



Calhoun et al.             Expires August 2003                 [Page 56]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      RADIUS Vendor code = Diameter Vendor code
      RADIUS Vendor type code = low order byte of Diameter AVP code
      RADIUS Vendor data length = length of Diameter data
                                  (not including padding)

   If the Diameter AVP code is greater than 255, then the RADIUS
   speaking code may use a Vendor specific field coding, if it knows one
   for that vendor.  Otherwise, the AVP will be ignored.  Unless it is
   flagged as Mandatory, in which case an "DIAMETER_AVP_UNSUPPORTED"
   error will be returned, and the message will not be sent.



9.5.2.  Forwarding a RADIUS VSA to a Diameter Vendor AVP

   The Diameter AVP will consist of the following fields;
      Diameter Flags: V=1, M=0, P=0
      Diameter Vendor code = RADIUS VSA Vendor code
      Diameter AVP code = RADIUS VSA Vendor type code
      Diameter AVP length = length of AVP (header + data + padding)
      Diameter Data = RADIUS VSA vendor data

   If the RADIUS receiving code knows of vendor specific fields
   interpretations for the specific vendor, it may employ them to parse
   an extended AVP code or data length, Otherwise the recommended
   standard fields will be used.

   Nested Multiple vendor data fields MUST be expanded into multiple
   Diameter AVPs.



10.  AVP Occurrence Tables

   The following tables present the AVPs defined in this document, and
   specify in which Diameter messages they MAY, or MAY NOT be present.
   Note that AVPs that can only be present within a Grouped AVP are not
   represented in this table.

   The table uses the following symbols:
      0      The AVP MUST NOT be present in the message.
      0+     Zero or more instances of the AVP MAY be present in the
            message.
      0-1    Zero or one instance of the AVP MAY be present in the
            message.
      1     One instance of the AVP MUST be present in the message.





Calhoun et al.             Expires August 2003                 [Page 57]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


10.1.  AA-Request/Answer AVP Table

   The table in this section is limited to the Command Codes defined in
   this specification.















































Calhoun et al.             Expires August 2003                 [Page 58]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                 +-----------+
                                 |  Command  |
                                 |-----+-----+
   Attribute Name                | AAR | AAA |
   ------------------------------|-----+-----+
   Acct-Interim-Interval         | 0   | 0-1 |
   ARAP-Challenge-Response       | 0   | 0-1 |
   ARAP-Features                 | 0   | 0-1 |
   ARAP-Password                 | 0-1 | 0   |
   ARAP-Security                 | 0-1 | 0-1 |
   ARAP-Security-Data            | 0+  | 0+  |
   ARAP-Zone-Access              | 0   | 0-1 |
   Auth-Application-Id           | 1   | 1   |
   Auth-Grace-Period             | 0-1 | 0-1 |
   Auth-Request-Type             | 1   | 1   |
   Auth-Session-State            | 0-1 | 0-1 |
   Authorization-Lifetime        | 0-1 | 0-1 |
   Callback-Id                   | 0   | 0-1 |
   Callback-Number               | 0-1 | 0-1 |
   Called-Station-Id             | 0-1 | 0   |
   Calling-Station-Id            | 0-1 | 0   |
   CHAP-Auth                     | 0-1 | 0   |
   CHAP-Challenge                | 0-1 | 0   |
   Class                         | 0+  | 0+  |
   Configuration-Token           | 0   | 0+  |
   Connect-Info                  | 0-1 | 0   |
   Destination-Host              | 0-1 | 0   |
   Destination-Realm             | 1   | 0   |
   Error-Message                 | 0   | 0-1 |
   Error-Reporting-Host          | 0   | 0-1 |
   Failed-AVP                    | 0+  | 0+  |
   Filter-Id                     | 0   | 0+  |
   Framed-Appletalk-Link         | 0   | 0-1 |
   Framed-Appletalk-Network      | 0   | 0+  |
   Framed-Appletalk-Zone         | 0   | 0-1 |
   Framed-Compression            | 0+  | 0+  |
   Framed-Interface-Id           | 0-1 | 0-1 |
   Framed-IP-Address             | 0-1 | 0-1 |
   Framed-IP-Netmask             | 0-1 | 0-1 |
   Framed-IPv6-Prefix            | 0+  | 0+  |
   Framed-IPv6-Pool              | 0   | 0-1 |
   Framed-IPv6-Route             | 0   | 0+  |
   Framed-IPX-Network            | 0   | 0-1 |
   Framed-MTU                    | 0-1 | 0-1 |
   Framed-Pool                   | 0   | 0-1 |
   Framed-Protocol               | 0-1 | 0-1 |
   Framed-Route                  | 0   | 0+  |
   ------------------------------|-----+-----+



Calhoun et al.             Expires August 2003                 [Page 59]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                 +-----------+
                                 |  Command  |
                                 |-----+-----+
   Attribute Name                | AAR | AAA |
   ------------------------------|-----+-----+
   Framed-Routing                | 0   | 0-1 |
   Idle-Timeout                  | 0-1 | 0-1 |
   Login-IP-Host                 | 0+  | 0+  |
   Login-IPv6-Host               | 0+  | 0+  |
   Login-LAT-Group               | 0-1 | 0-1 |
   Login-LAT-Node                | 0-1 | 0-1 |
   Login-LAT-Port                | 0-1 | 0-1 |
   Login-LAT-Service             | 0-1 | 0-1 |
   Login-Service                 | 0   | 0-1 |
   Login-TCP-Port                | 0   | 0-1 |
   Multi-Round-Time-Out          | 0   | 0-1 |
   NAS-Filter-Rule               | 0   | 0+  |
   NAS-Identifier                | 0-1 | 0   |
   NAS-IP-Address                | 0-1 | 0   |
   NAS-IPv6-Address              | 0-1 | 0   |
   NAS-Port                      | 0-1 | 0   |
   NAS-Port-Id                   | 0-1 | 0   |
   NAS-Port-Type                 | 0-1 | 0   |
   Originating-Line-Info         | 0-1 | 0   |
   Origin-Host                   | 1   | 1   |
   Origin-Realm                  | 1   | 1   |
   Origin-State-Id               | 0-1 | 0-1 |
   Password-Retry                | 0   | 0-1 |
   Port-Limit                    | 0-1 | 0-1 |
   Prompt                        | 0   | 0-1 |
   Proxy-Info                    | 0+  | 0+  |
   Re-Auth-Request-Type          | 0   | 0-1 |
   Redirect-Host                 | 0   | 0+  |
   Redirect-Host-Usage           | 0   | 0-1 |
   Redirect-Max-Cache-Time       | 0   | 0-1 |
   Reply-Message                 | 0   | 0+  |
   Result-Code                   | 0   | 1   |
   Route-Record                  | 0+  | 0   |
   Service-Type                  | 0-1 | 0-1 |
   Session-Id                    | 1   | 1   |
   Session-Timeout               | 0-1 | 0-1 |
   State                         | 0-1 | 0-1 |
   Termination-Action            | 0   | 0-1 |
   Termination-Cause             | 0   | 0-1 |
   Tunneling                     | 0+  | 0+  |
   User-Name                     | 0-1 | 0-1 |
   User-Password                 | 0-1 | 0   |
   ------------------------------|-----+-----+



Calhoun et al.             Expires August 2003                 [Page 60]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


10.2.  Accounting AVP Tables

   The tables in this section are used to represent which AVPs defined
   in this document are to be present in the Accounting messages,
   defined in [Base] and [RADIUSAcct].


10.2.1.  Accounting Framed Access AVP Table

   The table in this section is used when the Service-Type specifies
   Framed Access.

                                          +-----------+
                                          |  Command  |
                                          |-----+-----+
   Attribute Name                         | ACR | ACA |
   ---------------------------------------|-----+-----+
   Accounting-Application-Id              | 0-1 | 0-1 |
   Accounting-Input-Octets                | 1   | 0   |
   Accounting-Input-Packets               | 1   | 0   |
   Accounting-Output-Octets               | 1   | 0   |
   Accounting-Output-Packets              | 1   | 0   |
   Accounting-Record-Type                 | 1   | 1   |
   Accounting-Record-Number               | 0-1 | 0-1 |
   Accounting-Realtime-Required           | 0-1 | 0   |
   Accounting-Sub-Session-Id              | 0-1 | 0-1 |
   Acct-Application-Id                    | 0-1 | 0-1 |
   Acct-Session-Id                        | 0-1 | 0-1 |
   Acct-Multi-Session-Id                  | 0-1 | 0-1 |
   Acct-Authentic                         | 1   | 0   |
   Acct-Delay-Time                        | 0-1 | 0   |
   Acct-Interim-Interval                  | 0-1 | 0   |
   Acct-Link-Count                        | 0-1 | 0   |
   Acct-Session-Time                      | 1   | 0   |
   Acct-Tunnel-Connection                 | 0-1 | 0   |
   Acct-Tunnel-Packets-Lost               | 0-1 | 0   |
   Event-Timestamp                        | 0-1 | 0-1 |
   Error-Reporting-Host                   | 0   | 0-1 |
   Framed-AppleTalk-Link                  | 0-1 | 0   |
   Framed-AppleTalk-Network               | 0-1 | 0   |
   Framed-AppleTalk-Zone                  | 0-1 | 0   |
   Framed-Compression                     | 0-1 | 0   |
   ---------------------------------------|-----+-----+








Calhoun et al.             Expires August 2003                 [Page 61]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                          +-----------+
                                          |  Command  |
                                          |-----+-----+
   Attribute Name                         | ACR | ACA |
   ---------------------------------------|-----+-----+
   Framed-IP-Address                      | 0-1 | 0   |
   Framed-IP-Netmask                      | 0-1 | 0   |
   Framed-IPv6-Pool                       | 0-1 | 0   |
   Framed-IPX-Network                     | 0-1 | 0   |
   Framed-MTU                             | 0-1 | 0   |
   Framed-Pool                            | 0-1 | 0   |
   Framed-Protocol                        | 0-1 | 0   |
   Framed-Route                           | 0-1 | 0   |
   Framed-Routing                         | 0-1 | 0   |
   NAS-Filter-Rule                        | 0-1 | 0   |
   NAS-Identifier                         | 0-1 | 0-1 |
   NAS-IP-Address                         | 0-1 | 0-1 |
   NAS-IPv6-Address                       | 0-1 | 0-1 |
   NAS-Port                               | 0-1 | 0-1 |
   NAS-Port-Id                            | 0-1 | 0-1 |
   NAS-Port-Type                          | 0-1 | 0-1 |
   Origin-Host                            | 1   | 1   |
   Origin-Realm                           | 1   | 1   |
   Origin-State-Id                        | 0-1 | 0-1 |
   Proxy-Info                             | 0+  | 0+  |
   Route-Record                           | 0+  | 0+  |
   Service-Type                           | 0-1 | 0-1 |
   Termination-Cause                      | 0-1 | 0-1 |
   Tunnel-Assignment-Id                   | 0-1 | 0   |
   Tunnel-Client-Endpoint                 | 0-1 | 0   |
   Tunnel-Medium-Type                     | 0-1 | 0   |
   Tunnel-Private-Group-Id                | 0-1 | 0   |
   Tunnel-Server-Endpoint                 | 0-1 | 0   |
   Tunnel-Type                            | 0-1 | 0   |
   User-Name                              | 0-1 | 0-1 |
   Vendor-Specific-Application-Id         | 0-1 | 0-1 |
   ---------------------------------------|-----+-----+


10.2.2.  Accounting Non-Framed Access AVP Table

   The table in this section is used when the Service-Type specifies
   Non-Framed Access.








Calhoun et al.             Expires August 2003                 [Page 62]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


                                          +-----------+
                                          |  Command  |
                                          |-----+-----+
   Attribute Name                         | ACR | ACA |
   ---------------------------------------|-----+-----+
   Accounting-Application-Id              | 0-1 | 0-1 |
   Accounting-Input-Octets                | 1   | 0   |
   Accounting-Output-Octets               | 1   | 0   |
   Accounting-Record-Type                 | 1   | 1   |
   Accounting-Record-Number               | 0-1 | 0-1 |
   Accounting-Realtime-Required           | 0-1 | 0   |
   Accounting-Sub-Session-Id              | 0-1 | 0-1 |
   Acct-Application-Id                    | 0-1 | 0-1 |
   Acct-Session-Id                        | 0-1 | 0-1 |
   Acct-Multi-Session-Id                  | 0-1 | 0-1 |
   Acct-Authentic                         | 1   | 0   |
   Acct-Delay-Time                        | 0-1 | 0   |
   Acct-Interim-Interval                  | 0-1 | 0   |
   Acct-Link-Count                        | 0-1 | 0   |
   Acct-Session-Time                      | 1   | 0   |
   Event-Timestamp                        | 0-1 | 0-1 |
   Error-Reporting-Host                   | 0   | 0-1 |
   Login-IP-Host                          | 0+  | 0   |
   Login-IPv6-Host                        | 0+  | 0   |
   Login-LAT-Service                      | 0-1 | 0   |
   Login-LAT-Node                         | 0-1 | 0   |
   Login-LAT-Group                        | 0-1 | 0   |
   Login-LAT-Port                         | 0-1 | 0   |
   Login-Service                          | 0-1 | 0   |
   Login-TCP-Port                         | 0-1 | 0   |
   NAS-Identifier                         | 0-1 | 0-1 |
   NAS-IP-Address                         | 0-1 | 0-1 |
   NAS-IPv6-Address                       | 0-1 | 0-1 |
   NAS-Port                               | 0-1 | 0-1 |
   NAS-Port-Id                            | 0-1 | 0-1 |
   NAS-Port-Type                          | 0-1 | 0-1 |
   Origin-Host                            | 1   | 1   |
   Origin-Realm                           | 1   | 1   |
   Origin-State-Id                        | 0-1 | 0-1 |
   Proxy-Info                             | 0+  | 0+  |
   Route-Record                           | 0+  | 0+  |
   Service-Type                           | 0-1 | 0-1 |
   Termination-Cause                      | 0-1 | 0-1 |
   User-Name                              | 0-1 | 0-1 |
   Vendor-Specific-Application-Id         | 0-1 | 0-1 |
   ---------------------------------------|-----+-----+





Calhoun et al.             Expires August 2003                 [Page 63]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


11.  IANA Considerations

   This section provides guidance to the Internet Assigned Numbers
   Authority (IANA) regarding registration of values related to the
   Diameter protocol, in accordance with BCP 26 [IANAConsid].

   This document defines values in the namespaces that have created and
   defined in the Diameter Base [Base].  The IANA Considerations section
   of that document details the assignment criteria.  Values assigned in
   this document, or by future IANA action, must be coordinated within
   this shared namespace.


11.1.  Command Codes

   This specification assigns the values 265 and 268 from the Command
   Code namespace defined in [Base].  See sections 3.1 and 3.2 for the
   assignment of the namespace in this specification.


11.2.  AVP Codes

   This specification assigns the values 363-366 and 400-405 from the
   AVP Code namespace defined in [Base]. See sections 4, and 5 for the
   assignment of the namespace in this specification.  Note that the
   values 363-366 are jointly, but consistently, assigned in [DiamMIP].

   This specification also specifies the use of AVPs in the 0-255 range,
   which are defined in [RADIUSTypes].  These values are assigned by the
   policy in RFC 2865 Section 6. [RADIUS]


11.3.  Application Identifier

   This specification uses the value one (1) in the Application
   Identifier namespace as assigned in [Base].  See section 1.2 above
   for more information.


11.4.  CHAP-Algorithm AVP Values

   As defined in Section 5.5, the CHAP-Algorithm AVP (AVP Code 403) uses
   the values of the "PPP AUTHENTICATION ALGORITHMS" namespace defined
   in [PPPCHAP].







Calhoun et al.             Expires August 2003                 [Page 64]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


12.  Security Considerations

   The security considerations  of the Diameter protocol itself have
   been discussed in [Base].

   This document does not contain a security protocol, but does discuss
   how PPP authentication protocols can be carried within the Diameter
   protocol. The PPP authentication protocols that are described are PAP
   and CHAP.

   The use of PAP SHOULD be discouraged, since it exposes user's
   passwords to possibly non-trusted entities. However, PAP is also
   frequently used for use with One-Time Passwords (OTP), which do not
   expose a security risk.

   This document also describes how CHAP can be carried within the
   Diameter protocol, which is required for RADIUS backward
   compatibility. The CHAP protocol, as used in a RADIUS environment,
   facilitates authentication replay attacks.



13.  References


13.1.  Normative References


[Base]        P. Calhoun, et.al, "Diameter Base Protocol", draft-ietf-
              aaa-diameter-17.txt, IETF work in progress, December 2002.

[AAATrans]    B. Aboba, J. Wood. "Authentication, Authorization and
              Accounting (AAA) Transport Profile", draft-ietf-aaa-
              transport-08, IETF work in progress, April 2002

[RADIUS]      C. Rigney, A. Rubens, W. Simpson, S. Willens, "Remote
              Authentication Dial In User Service (RADIUS)", RFC 2865,
              June 2000.

[RADIUSTypes] IANA, "RADIUS Types", URL:
              <http://www.iana.org/assignments/radius-types>

[RADIUSIPv6]  B. Aboba, G. Zorn, D. Mitton, "RADIUS and IPv6", RFC 3162,
              August 2001.

[IPv6Addr]    Hinden, R., Deering, S., "IP Version 6 Addressing
              Architecture", RFC 2373, July 1998




Calhoun et al.             Expires August 2003                 [Page 65]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


[PPPCHAP]     W. Simpson, "PPP Challenge Handshake Authentication
              Protocol (CHAP)", RFC 1994, August 1996.

[IANAConsid]  Narten, Alvestrand, "Guidelines for Writing an IANA
              Considerations Section in RFCs", BCP 26, RFC 2434, October
              1998

[IANA]        IANA Assigned Numbers Database, URL:
              <http://www.iana.org/numbers.html>

[Keywords]    S. Bradner, "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

[ISOLatin]    ISO 8859. International Standard -- Information Processing
              -- 8-bit Single-Byte Coded Graphic Character Sets -- Part
              1: Latin Alphabet No. 1, ISO 8859-1:1987.  URL:
              <http://www.iso.ch/cate/d16338.html>

[ANITypes]    NANPA Number Resource Info, ANI Assignments, URL:
              <http://www.nanpa.com/number_resource_info/
              ani_ii_assignments.html>


13.2.  Informative References


[NAI]         B. Aboba, M. Beadles, "The Network Access Identifier." RFC
              2486.  January 1999.

[RADIUSAcct]  C. Rigney, "RADIUS Accounting", RFC 2866, June 2000.

[RADIUSExt]   C. Rigney, W. Willats, P. Calhoun, "RADIUS Extensions",
              RFC 2869, June 2000.

[RADTunnels]  G. Zorn, D. Leifer, A. Rubens, J. Shriver, M. Holdrege, I.
              Goyret, "RADIUS Attributes for Tunnel Protocol Support",
              RFC 2868, June 2000.

[RADTunlAcct] G. Zorn, B. Aboba, D. Mitton, "RADIUS Accounting
              Modifications for Tunnel Protocol Support", RFC 2867, June
              2000.

[RADDynAuth]  M. Chiba, M Dommety, M. Eklund, D. Mitton, B. Aboba,
              draft-chiba-radius-dynamic-authorization-06.txt", Work in
              Progress, Jan 2003

[ExtRADPract] D. Mitton, "Network Access Servers Requirements: Extended
              RADIUS Practices", RFC 2882, July 2000.



Calhoun et al.             Expires August 2003                 [Page 66]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


[NASModel]    D. Mitton, M. Beadles, "Network Access Server Requirements
              Next Generation (NASREQNG) NAS Model", RFC 2881, July
              2000.

[NASCriteria] M. Beadles, D. Mitton, "Criteria for Evaluating Network
              Access Server Protocols", RFC 3169, September 2001.

[AAACriteria] Aboba, et al., "Criteria for Evaluating AAA Protocols for
              Network Access", RFC 2989, Nov 2000.

[DiamEAP]     G. Zorn, "Diameter EAP Application", draft-ietf-aaa-
              eap-01.txt, IETF work in progress, August 2002.

[DiamCMS]     P. Calhoun, W. Bulley, S. Farrell, "Diameter CMS Security
              Application", draft-ietf-aaa-diameter-cms-sec-04.txt, IETF
              work in progress, March 2002.

[DiamMIP]     P. Calhoun, C. Perkins, T. Johansson, "Diameter Mobile IP
              Application", draft-ietf-aaa-diameter-mobileip-13.txt,
              IETF work in progress, October 2002.

[RAD802.1X]   P. Congdon, et.al "IEEE 802.1X RADIUS Usage Guidelines",
              draft-congdon-8021x-RADIUS-20.txt, IETF work in progress,
              June 2002.

[802.1X]      IEEE Standard for Local and metropolitan networks - Port-
              Based Network Access Control, IEEE Std 802.1X-2001, June
              2001

[CDMA2000]    3GPP2 "P.S0001-B", Wireless IP Network Standard, October
              2002.
              http://www.3gpp2.com/Public_html/specs/P.S0001-B_v1.0.pdf

[TCPCompress] Jacobson, "Compressing TCP/IP headers for low-speed serial
              links", RFC 1144, February 1990.

[PPPMP]       Sklower, Lloyd, McGregor, Carr, "The PPP Multilink
              Protocol (MP)", RFC 1717, November 1994.

[PPTP]        Hamzeh, K., Pall, G., Verthein, W., Taarud, J., Little,
              W., Zorn, G., "Point-to-Point Tunneling Protocol (PPTP)",
              RFC 2637, July 1999

[L2F]         Valencia, A., Littlewood, M., Kolar, T., "Cisco Layer Two
              Forwarding (Protocol) 'L2F'", RFC 2341, May 1998

[L2TP]        Townsley, W. M., Valencia, A., Rubens, A., Pall, G. S.,
              Zorn, G., Palter, B., "Layer Two Tunneling Protocol



Calhoun et al.             Expires August 2003                 [Page 67]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


              (L2TP)", RFC 2661, August 1999

[ATMP]        Hamzeh, K., "Ascend Tunnel Management Protocol - ATMP",
              RFC 2107, February 1997

[MSMPPE]      G. Pall, G. Zorn, "Microsoft Point-To-Point Encryption
              (MPPE) Protocol", RFC 3078, March 2001.

[UTF-8]       F. Yergeau, "UTF-8, a transformation format of ISO 10646",
              RFC 2279, January 1998.

[STD51]       W. Simpson, Editor, "The Point-to-Point Protocol (PPP)",
              STD 51, RFC 1661, July 1994



14.  Acknowledgements


   The authors would like to thank Carl Rigney, Allan C. Rubens, William
   Allen Simpson, and Steve Willens for their work on the original
   RADIUS [RADIUS], from which many of the concepts in this
   specification were derived. Thanks, also, to: Carl Rigney for
   [RADIUSAcct] and [RADIUSExt]; Ward Willats for [RADIUSExt]; Glen
   Zorn, Bernard Aboba and Dave Mitton for [RADTunlAcct] and [RADIPV6];
   Dory Leifer, John Shriver, Matt Holdrege and Ignacio Goyret for their
   work on [RADTunnels]. This document stole text and concepts from both
   [RADTunnels] and [RADIUSExt]. Thanks go to Carl Williams for
   providing IPv6 specific text.

   The authors would also like to acknowledge the following people for
   their contributions in the development of the Diameter protocol:
   Bernard Aboba, Jari Arkko, William Bulley, Kuntal Chowdhury, Daniel
   C. Fox, Lol Grant, Nancy Greene, Jeff Hagg, Peter Heitman, Paul
   Krumviede, Fergal Ladley, Ryan Moats, Victor Muslin, Kenneth Peirce,
   Sumit Vakil, John R. Vollbrecht and Jeff Weisberg.

   Finally, Pat Calhoun would like to thank Sun Microsystems since most
   of the effort put into this document was done while he was in their
   employ.


15.  Authors' Addresses

   Questions about this memo can be directed to:

      Pat R. Calhoun
      Black Storm Networks



Calhoun et al.             Expires August 2003                 [Page 68]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


      250 Cambridge Avenue, Suite 200
      Palo Alto, California, 94306
      USA

        Phone:  1 650-617-2932
        Fax:    1 650-786-6445
        E-mail: pcalhoun@diameter.org


      Glen Zorn
      Cisco Systems, Inc.
      500 108th Avenue N.E., Suite 500
      Bellevue, WA 98004
      USA

        Phone:  1 425-471-4861
        E-Mail: gwz@cisco.com


      David Spence
      Interlink Networks, Inc.
      775 Technology Drive, Suite 200
      Ann Arbor, MI  48108
      USA

        Phone:  1 734-821-1203
        Fax:    1 734-821-1235
        EMail:  dspence@interlinknetworks.com

      David Mitton
      Circular Logic Unlimited
      733 Turnpike St #154
      North Andover, MA 01845

        Email:  david@mitton.com



Intellectual Property Considerations

   The IETF takes no position regarding the validity or scope of any
   intellectual property or other rights that might be claimed to  per-
   tain to the implementation or use of the technology described in this
   document or the extent to which any license under such rights might
   or might not be available; neither does it represent that it has made
   any effort to identify any such rights.  Information on the IETF's
   procedures with respect to rights in standards-track and standards-
   related documentation can be found in BCP-11.  Copies of claims of



Calhoun et al.             Expires August 2003                 [Page 69]

INTERNET-DRAFT          Diameter NAS Application                Feb 2003


   rights made available for publication and any assurances of licenses
   to be made available, or the result of an attempt made to obtain a
   general license or permission for the use of such proprietary rights
   by implementers or users of this specification can be obtained from
   the IETF Secretariat.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights which may cover technology that may be required to practice
   this standard.  Please address the information to the IETF Executive
   Director.


Full Copyright Statement

   Copyright (C) The Internet Society (2003).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are
   included on all such copies and derivative works. However, this
   document itself may not be modified in any way, such as by removing
   the copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of
   developing Internet standards in which case the procedures for
   copyrights defined in the Internet Standards process must be
   followed, or as required to translate it into languages other than
   English. The limited permissions granted above are perpetual and will
   not be revoked by the Internet Society or its successors or assigns.
   This document and the information contained herein is provided on an
   "AS IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING
   TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING
   BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION
   HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF
   MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.














Calhoun et al.             Expires August 2003                 [Page 70]


